{
  "metadata": {
    "database_code": "skt",
    "database_name": "Schema Therapy Terminology",
    "database_url": "https://sonaveeb.ee/ds/skt",
    "contact": "Kaia Kastepõld-Tõrs (skeemiteraapia@gmail.com)",
    "collection_date": "2025-10-14T22:49:05.282797",
    "term_count": 250
  },
  "terms": [
    {
      "term": "abandonment",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/abandonment",
      "letter": "a",
      "language": "inglise",
      "synonyms": [
        "instability"
      ],
      "definition": "eeldus, et kõik elu jooksul loodud tähtsad suhted katkevad ning sellest tulenev pidev mure hülgamise ees, the feeling that important relationships which they have formed will never last and thus they are constantly worried about being abandoned by others, The perceived instability or unreliability of those available for support and connection. Involves the sense that significant others will not be able to continue providing emotional support, connection, strength, or practical protection because they are emotionally unstable and unpredictable (e.g., have angry outbursts), unreliable, or present only erratically; because they will die imminently; or because they will abandon the individual in favor of someone better., The patient expects that significant others will eventually abandon him. Others are unreliable and unpredictable in their support and connection. When the patient feels abandoned he switches between feelings of anxiety, grief and anger."
    },
    {
      "term": "abuse",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/abuse",
      "letter": "a",
      "language": "inglise",
      "synonyms": [
        "mistrust"
      ],
      "definition": "eeldus, et saadakse teiste poolt kuritarvitatud, alandatud või muul moel halvasti koheldud ning sellest tulenev pidev kahtlus, et teised teevad neile meelega haiget, people with this schema expect to be abused,humiliated,or in other ways badly treated by others, they are constantly suspicious, because they are afraid of being deliberately harmed., The expectation that others will hurt, abuse, humiliate, cheat, lie, manipulate, or take advantage. Usually involves the perception that the harm is intentional or the result of unjustified and extreme negligence. May include the sense that one always ends up being cheated relative to others or “getting the short end of the stick.”"
    },
    {
      "term": "afektisild",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/afektisild",
      "letter": "a",
      "language": "eesti",
      "synonyms": [],
      "definition": "terapeutiline tehnika, millega käesoleval hetkel esinevaid emotsioone kasutatakse „sillana“, et jõuda mälestusteni varajastest kogemustest lapsepõlves, therapeutic technique, where a recent important emotional experience or the present emotional state of the patient can be used to find a a relevant childhood image"
    },
    {
      "term": "affect bridge",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/affect%20bridge",
      "letter": "a",
      "language": "inglise",
      "synonyms": [],
      "definition": "terapeutiline tehnika, millega käesoleval hetkel esinevaid emotsioone kasutatakse „sillana“, et jõuda mälestusteni varajastest kogemustest lapsepõlves, therapeutic technique, where a recent important emotional experience or the present emotional state of the patient can be used to find a a relevant childhood image"
    },
    {
      "term": "alienation",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/alienation",
      "letter": "a",
      "language": "inglise",
      "synonyms": [],
      "definition": "Seisund, kus kesksed protsessid või normid muutuvad osalistele “võõraks” ning mille tõttu toimub ühiskonnast väljasotsialiseerumine. Selle tulemusel kaotab ühiskond olulise osa kontrollist oma toimimise ja indiviid oma elutegevuse üle. Võõrandumise tulemusena nõrgevad sotsiaalsed sidemed, langeb moraal ning tekib anoomia"
    },
    {
      "term": "alistumine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/alistumine",
      "letter": "a",
      "language": "eesti",
      "synonyms": [
        "allaandmine"
      ],
      "definition": "skeemiga toime tulemise viis, mis sisaldab aktiveerunud skeemile passiivset ja abitut allumist, a broad tendency to give in to the triggered schema or schemas, wchich can manifest itself in a variety of specific surrendering coping responses, instead of fighting against the schemas in a healthy way, the surrendering persona submits to them, passively and helplessly giving into them, a person acts as if the schema were true and surrenders into the subsequent behavior patterns."
    },
    {
      "term": "allaandmine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/allaandmine",
      "letter": "a",
      "language": "eesti",
      "synonyms": [
        "allavandumine"
      ],
      "definition": "vastupanust loobumine, end võidetuks tunnistamine, kaotajaks jäämine, mingi olukorraga leppimine"
    },
    {
      "term": "allutatus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/allutatus",
      "letter": "a",
      "language": "eesti",
      "synonyms": [],
      "definition": "eeldus, et iseenda soovid, arvamused ja tunded ei ole teiste silmis õigustatud või olulised ning sellest tulenevalt allutatakse end teistele vältimaks kardetavat kättemaksu, hülgamist või viha osaliseks saamist, excessive surrendering of control to others because one feels coerced—submitting in order to avoid anger, retaliation, or abandonment, The patient submits to the control of others in order to avoid negative consequences. The patient ignores his own needs because he fears conflict and punishment (van Vreeswijk et al., 2012, p.30). Over time, compensatory beliefs become maladaptive and reinforce the central beliefs. For example, a subjugation schema might develop to protect an individual from the negative impact of mistrust/abuse core beliefs that resulted from an abusive early environment. However, a style of letting others be in control leaves the individual vulnerable to further abuse later in life, thus reinforcing the mistrust/ abuse belief., Peamiselt loovutatakse kontroll kahes valdkonnas: (a) vajadused: isiklike eelistuste, otsuste ja soovide allutamine/allasurumine; (b) emotsioonid: emotsioonide väljendamise, eelkõige viha allasurumine. Skeem sisaldab tavapäraselt uskumust, et iseenda soovid, arvamused ja tunded ei ole teiste silmis õigustatud või olulised. Skeem väljendub sageli ülemäärase pärioleku ja järeleandlikkuse kalduvusena, mis on kombineeritud ülitundlikkusega lõksus olemise tunnete suhtes. See päädib vihatunnete kuhjumisena, mis omakorda väljenduvad vähekohastumuslike sümptomitena (nt passiiv-agressiivne käitumine, kontrollimatud pahameele väljaelamised, psühhosomaatilised sümptomid, lähedusest hoidumine/eemaldumine, väljaelamine käitumisse või ainete kuritarvitamine., The two major forms of subjugation are: A. Subjugation of needs: Suppression of one’s preferences, decisions, and desires. B. Subjugation of emotions: Suppression of emotions, especially anger. Usually involves the perception that one’s own desires, opinions, and feelings are not valid or important to others. Frequently presents as excessive compliance, combined with hypersensitivity to feeling trapped. Generally leads to a buildup of anger, manifested in maladaptive symptoms (e.g., passive–aggressive behavior, uncontrolled outbursts of temper, psychosomatic symptoms, withdrawal of affection, “acting out,” substance abuse)."
    },
    {
      "term": "angry child mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/angry%20child%20mode",
      "letter": "a",
      "language": "inglise",
      "synonyms": [],
      "definition": "lapse olek, milles tuntakse ja väljendatakse viha või raevu vastusena baasiliste emotsionaalsete vajaduste (tajutud) rahuldamata jätmisele ühe või mitme varase mittekohastumusliku skeemi aktiveerumisel, the part that is enraged about unmet emotional needs and that acts in anger without regard to consequences, The Angry Child mode is evident in uncontrolled, or poorly controlled, expressions of anger. More extreme manifestations include screaming, shouting, swearing, throwing things, banging on things, or breaking things. Less extreme manifestations include having an angry or agitated facial expression or body language, or speaking in a loud or angry voice., Feels intensely angry, enraged, infuriated, frustrated,or impatient, because the core emotional (or physical) needs of the vulnerable child are not being met. Rebels against maltreatment and vents suppressed anger in inappropriate ways. May make demands that seem entitled or spoiled and which alienated others."
    },
    {
      "term": "approval seeking",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/approval%20seeking",
      "letter": "a",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et teiste tunnustuse, heakskiidu ja tähelepanu otsimine ning sobitumine on oluline iseolemise arvelt, excessive emphasis on gaining approval, recognition, or attention from other people or on fitting in at the expense of developing a secure and true sense of self, Enesest lugupidamine ja väärtuse tunnetamine on sõltuv teistelt saadud tagasisidest pigem kui iseolemise valikust. Võib sisaldada staatuse, välimuse, sotsiaalse aktsepteerituse, raha või saavutuste ületähtsustamist heakskiidu, imetluse või tähelepanu vahenditena (ei ole primaarselt seotud võimu või kontrolliga). Sageli päädib sellega, et elu olulisi küsimusi puudutavad valikud ja otsused ei ole autentsed, ollakse rahulolematu või ülitundlik (võimaliku) tõrjumise suhtes., One’s sense of esteem is dependent primarily on the reactions of others rather than on one’s own natural inclinations. Sometimes includes an overemphasis on status, appearance, social acceptance, money, or achievement as means of gaining approval, admiration, or attention (not primarily for power or control). Frequently results in major life decisions that are inauthentic or unsatisfying or in hypersensitivity to rejection."
    },
    {
      "term": "autonomy",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/autonomy",
      "letter": "a",
      "language": "inglise",
      "synonyms": [],
      "definition": "Võime ja võimalus oma asju ise korraldada. Vrd iseseisvus, sõltumatus, omavalitsus"
    },
    {
      "term": "autonoomia",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/autonoomia",
      "letter": "a",
      "language": "eesti",
      "synonyms": [],
      "definition": "osaline iseseisvus, suhteline sõltumatus"
    },
    {
      "term": "avoidance",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/avoidance",
      "letter": "a",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemiga toime tulemise viis, mis sisaldab skeemi aktivatsiooni vallandavate stiimulite nagu näiteks inimeste, olukordade, mõtete jne vältimist, a broad tendency to avoid the triggered schema or schemas, which can manifest itself in a variety of specific avoidant coping responses, Avoidant coping responses involve an avoidance of people or situations that trigger one's schemas., Social situation and/or emotions are put aside by social withdrawal, substance abuse, and other avoidant behaviors."
    },
    {
      "term": "avoidant protector mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/avoidant%20protector%20mode",
      "letter": "a",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mida iseloomustab olukordade (inimeste, kohtade, vestluste, tegevuste) vältimine, milles varased mittekohastumuslikud skeemid võiksid aktiveeruda"
    },
    {
      "term": "baasiline emotsionaalne vajadus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/baasiline%20emotsionaalne%20vajadus",
      "letter": "b",
      "language": "eesti",
      "synonyms": [],
      "definition": "bioloogilise alusega universaalne emotsionaalne vajadus, mille täidetus lapsepõlves tagab psühholoogilise tervise ja heaolu, Skeemiteraapia kontekstis räägitakse viiest baasiliste emotsionaalsete vajaduste rühmast: turvalisus, autonoomsus, vabadus väljendada oma vajadusi ja emotsioone, spontaansus ja mängulisus, realistlikud piirid., Set of universal emotional needs. Psychological health is the ability to get one's needs met in an adaptive manner., Basic emotional needs of a child. When these needs are not met in childhood, schemas develop that lead to unhealthy life patterns. Each of the 18 schemas represent cpecific emotional needs that were not adequately met in childhood or adolescence."
    },
    {
      "term": "baasiline heaolu ja turvalisus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/baasiline%20heaolu%20ja%20turvalisus",
      "letter": "b",
      "language": "eesti",
      "synonyms": [],
      "definition": "realistik turvatunne ja usaldus, et ka tulevik on turvaline ja hea, realistic sense of safety and confidence in future security and wellbeing"
    },
    {
      "term": "basic health and safety",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/basic%20health%20and%20safety",
      "letter": "b",
      "language": "inglise",
      "synonyms": [
        "optimism"
      ],
      "definition": "realistik turvatunne ja usaldus, et ka tulevik on turvaline ja hea, realistic sense of safety and confidence in future security and wellbeing"
    },
    {
      "term": "bully and attack mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/bully%20and%20attack%20mode",
      "letter": "b",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, milles olles kasutab inimene ähvardusi või agressiivsust, et kinnitada oma üleolekut, saada midagi mida ta tahab, või kätte maksta tajutud ohu eest ning selles olekus tunneb inimene end tugeva ja võimsana, mis kompenseerib nõrkuse ja abituse tunnet, a state in which patients use threats or aggression to assert their dominance, get something they want, or retaliate against a perceived threat or rival and when in this state, patients feel strong and powerful, compensating for underlying feelings of weakness and helplessness"
    },
    {
      "term": "chair dialogue",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/chair%20dialogue",
      "letter": "c",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks toolitehnika, milles kasutatakse toole erinevate olekute ja skeemide esindusena nende teadvustamise, nendevahelise suhtluse käivitamise ja muutmise eesmärgil, experiential technique in schema therapy which involves the use of chairs to represent different modes. ...a dialogue between the client's different sides"
    },
    {
      "term": "chair work",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/chair%20work",
      "letter": "c",
      "language": "inglise",
      "synonyms": [],
      "definition": "terapeutiline tehnika, millega soodustatakse erinevate olekute, mälestuste, rollide vm osade vahelist suhtlust, seda toolide abil operatsionaliseerides, What is chairwork? At its most essential, there are two basic forms of psychotherapeutic dialogue. In the first, known as the “empty chair” dialogue, the patient is invited to sit in one chair and to imagine a person in the opposite chair. Typically, this is a person with whom they have some kind of “unfinished business” or unresolved emotional connection. In the second form, the patient is often working with inner conflicts. In the case of a decision, they can express a viewpoint in one chair and then switch to the one opposite to express the alternative view. This is known as the two-chair dialogue. It is, perhaps, time to let go of this convention and organize our use of these therapeutic encounters in terms of whether they are “external” or “internal”; that is, did the therapist ask the patient to dialogue with a person or object outside of him- or herself or with an internal force or experience?, With the next cognitive technique, patients learn to conduct dialogues between their “schema side” and “healthy side.” Adapting the Gestalt “empty chair” technique, the therapist instructs patients to switch chairs as they play the two sides: In one chair they play the schema side, in the other they play the healthy side."
    },
    {
      "term": "child mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/child%20mode",
      "letter": "c",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks kategooria skeemi olekutest, mis on sünnipärased ja universaalsed vastused emotsionaalsete vajaduste rahuldatusele ning neid olekuid iseloomustavad tugevad tunded ning lapsele omased reaktsioonid, primary or innate intense feelings that involve the innate reactions a child has, Primary or innate child modes (Vulnerable Child, Angry Child, Impulsive Child) are said to develop when basic emotional needs in childhood (such as safety, nurturance, or autonomy) are not adequately met. These “child modes” are defined by intense feelings such as fear, helplessness, or rage, and involve the innate reactions a child has."
    },
    {
      "term": "competence",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/competence",
      "letter": "c",
      "language": "inglise",
      "synonyms": [],
      "definition": "asjakohased teadmised ja oskused ning võimekus tegutseda tulemuslikult mingil alal"
    },
    {
      "term": "compliant surrender mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/compliant%20surrender%20mode",
      "letter": "c",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mida iseloomustab kuulekus ja järeleandlikkus teiste ootustele ja nõudmistele enamasti isiklike vajaduste arvelt, The Compliant Surrenderer submits to the schema, becoming once again the passive, helpless child who must give in to others., Acts in a passive, subservient,submissive, reassurance seeking or self-deprecating way towards others out of fear of conflict or rejection. Passively accepts abuse, or simply does not take steps to get healthy needs met. selects partners or engages in other behavior that directly maintains the self-defeating schema-driven patterns."
    },
    {
      "term": "core emotional need",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/core%20emotional%20need",
      "letter": "c",
      "language": "inglise",
      "synonyms": [],
      "definition": "bioloogilise alusega universaalne emotsionaalne vajadus, mille täidetus lapsepõlves tagab psühholoogilise tervise ja heaolu, Skeemiteraapia kontekstis räägitakse viiest baasiliste emotsionaalsete vajaduste rühmast: turvalisus, autonoomsus, vabadus väljendada oma vajadusi ja emotsioone, spontaansus ja mängulisus, realistlikud piirid., Set of universal emotional needs. Psychological health is the ability to get one's needs met in an adaptive manner., Basic emotional needs of a child. When these needs are not met in childhood, schemas develop that lead to unhealthy life patterns. Each of the 18 schemas represent cpecific emotional needs that were not adequately met in childhood or adolescence."
    },
    {
      "term": "corrective emotional experience",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/corrective%20emotional%20experience",
      "letter": "c",
      "language": "inglise",
      "synonyms": [],
      "definition": "terapeutilise sekkumise viis, mille käigus rakendatakse kogemuslikke ja terapeutilise suhte tehnikaid, korrigeerimaks varaste emotsionaalsete suhtekogemuste baasil välja kujunenud mittekohastumuslikke skeeme, Utilizing the therapy relationship to establish a caring, trusting relationship that allows the patient to undergo the experience of having their needs met in a sufficient, healthy and adaptive way., Terapeudi ja patsiendi suhetes kultiveeritud hooliv ja usalduslik suhe, mis võimaldab patsiendil kogeda oma emotsionaalsete vajaduste rahuldamise võimalikkust küllaldasel, tervel ja kohanemist toetaval viisil."
    },
    {
      "term": "defectiveness",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/defectiveness",
      "letter": "d",
      "language": "inglise",
      "synonyms": [
        "shame"
      ],
      "definition": "eeldus, et ollakse fundamentaalselt puudulik, alaväärne ja mittetahetud ning sellest tulenev häbitunne ja veendumus, et ei väärita teiste armastust, austust või tähelepanu, the feeling that one is defective, bad, unwanted, inferior, or invalid in important respects or that one would be unlovable to significant others if exposed, May involve hypersensitivity to criticism, rejection, and blame; self-consciousness, comparisons, and insecurity around others; or a sense of shame regarding one’s perceived flaws. These flaws may be private (e.g., selfishness, angry impulses, unacceptable sexual desires) or public (e.g., undesirable physical appearance, social awkwardness)., The feeling of being worthless often leads to a strong sense of shame., This schema is characterized by feelings of defectiveness, inferiority, and being unwanted; they feel undeserving of any love, respect, or attention, as they feel they are not worthy - no matter how they actually behave."
    },
    {
      "term": "demanding parent mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/demanding%20parent%20mode",
      "letter": "d",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks sisemise kriitiku olekutest, milles esitatakse enda suhtes ebarealistlikult kõrgeid nõudmisi ja oodatakse nendele vastamist järeleandmisi tegemata. Tuntakse, et peab olema perfektne ja ei tohi olla spontaanne ega teha vigu, The Demanding Parent mode is the side of the patient that places almost impossible demands on him.This often takes the form of demands for achievement or success, but can also involve other types of demands, for example, a demand that a child sacrifice his own autonomy to take care of the parent. When in Demanding Parent mode, the patient experiences unrelenting pressure to push himself to succeed. Patients with this mode often believe that they need this side of themselves to push them to achieve, and fail to recognize the way in which this side can be crippling (p. 64), Continually pushes and pressures the child to meet excessively high standards. Feels that the only acceptable way to be is to be perfect and an overachiever, to keep everything in order, to strive for high status, to be humble, to put other 's needs before one's own, or to be efficient or avoid wasting time. The person feels that it is wrong to express feelings or to be spontaneous (p. 44)"
    },
    {
      "term": "dependence",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/dependence",
      "letter": "d",
      "language": "inglise",
      "synonyms": [
        "incompetence"
      ],
      "definition": "eeldus, et ollakse võimetu pädevana toimima igapäevaelu kohustustes toetumata olulisel määral teiste abile (nt enese eest hoolt kandma, lahendama igapäevelu probleeme, vastu võtma otsuseid või lahendama uudseid ülesandeid), mis sageli väljendub abitusena, the belief that one is unable to handle one’s everyday responsibilities in a competent manner, without considerable help from others (e.g., take care of oneself, solve daily problems, exercise good judgment, tackle new tasks, make good decisions)., Often presents as helplessness, In extreme cases, individuals might feel unable to take care of themselves, solve daily problems, exercise good judgment, tackle new tasks, or make good decisions. In other cases, this sense of helplessness may be more circumscribed and be activated in particular situations or settings (e.g., in making important professional decisions or in choosing a partner., Äärmuslikematel juhtudel võidakse tunda end võimetuna enesehoolitsuseks, igapäevaelu probleemide lahendamisel, otsuseid nõudvates olukordades või uute olukordade käsitlemisel. Teistel juhtudel võib sarnane abituse kogemine olla enamal määral olukorra spetsiifiline ja aktiveeruda kindlates situatsioonides või juhtudel (näiteks olukorras, kus on vajalik langetada olulisi professionaalseid otsuseid või partneri valiku olukorras"
    },
    {
      "term": "detached protecter mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/detached%20protecter%20mode",
      "letter": "d",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mida iseloomustab emotsionaalne vältimine ja milles olles inimene eitab tundeid ja probleeme, on emotsionaalselt eraldunud, distantseerunud, tuim või intellektualiseeriv ja üliratsionaalne, a state of emotional avoidance. When in this state, patients deny feelings and problems, are emotionally detached, distant, and numb, or are intellectualized and super-rational, The Detached Protector withdraws psychologically from the pain of the schema by emotionally detaching, abusing substances, self-stimulating, avoiding people, or utilizing other forms of escape. The function of this mode is to cut off emotional needs, disconnect from others, and behave submissively in order to avoid punishment., A mode that ranges from a person being “spacey,” or briefly losing focus in an interaction, to severe dissociation."
    },
    {
      "term": "detached self-soother mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/detached%20self-soother%20mode",
      "letter": "d",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, milles olles üritatakse rahustada või leevendada oma negatiivseid emotsioone, tehes seda läbi kompulsiivsete, korduvate või sõltuvuslike tegevuste nagu näiteks narkootikumide või alkoholi tarvitamise, söömasööstude, kompulsiivse ostlemise või mängurluse või internetisõltuvuse läbi, The Detached Self-soother mode involves attempts to calm or soothe one's feelings through compulsive, repetitive, or addictive behaviors, such as drug or alcohol use, binge eating, compulsive shopping, compulsive gambling, or internet addiction."
    },
    {
      "term": "disconnection and rejection",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/disconnection%20and%20rejection",
      "letter": "d",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on eeldus, et vajadus turvalisuse, stabiilsuse, hoole, empaatia, emotsioonide jagamise, aksepteerimise ning austuse järele jääb ootuspärasel viisil vastamata, the expectation that one’s needs for security, safety, stability, nurturance, empathy, sharing of feelings, acceptance, and respect will not be met in a predictable manner, Selle valdkonna skeemid kujunevad sageli siis, kui varane kasvukeskkond on eraldunud, eemalolev, külm, tõrjuv, vägivaldne, plahvatuslik, ennustamatu, kuritarvitav"
    },
    {
      "term": "distsiplineerimata lapse olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/distsiplineerimata%20lapse%20olek",
      "letter": "d",
      "language": "eesti",
      "synonyms": [],
      "definition": "lapse olek, milles ei suudeta taluda frustratsiooni ega sundida end lõpetama rutiinseid või igavaid ülesandeid ning selles olekus ei taluta rahulolematust või ebamugavust (valu, konflikti, pingetunnet), The patient has no tolerance of frustration and cannot force himself to finish routine or boring tasks. He cannot bear dissatisfaction or discomfort (pain, conflict, or overexertion) and he behaves like a spoiled child."
    },
    {
      "term": "dysfunctional parent mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/dysfunctional%20parent%20mode",
      "letter": "d",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks kategooria skeemi olekutest, mis on lapsepõlves olulistes suhetes (lapsevanem, vm oluline isik) kogetud negatiivsete aspektide valikuline internaliseerumine, Dysfunctional Parent Modes reflect the selective internalization of negative aspects of attachment figures (e.g., parents, teachers, peers, etc.) during childhood and adolescence (p. 7), These modes have in common an internalized parental \"voice\" that criticizes or denigrates the patient (Punitive Parent) or places almost impossible demands on him (Demanding or Critical Parent) (p. 63), In these modes, the patient becomes like the parent who has been internalized (p. 44), Dysfunctional parent modes are viewed as internalizations of dysfunctional parental responses to the child. Conceptually, these modes overlap with the notion of (perpetrator) introjects in psychodynamic theory (p. 36)"
    },
    {
      "term": "düsfunktsionaalne kaitseolek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/d%C3%BCsfunktsionaalne%20kaitseolek",
      "letter": "d",
      "language": "eesti",
      "synonyms": [
        "düsfunktsionaalne toimetuleku olek"
      ],
      "definition": "üks kategooria skeemi olekutest, mille eesmärk on psühholoogiliselt kaitsta aktiveerunud skeemiga kaasnevate ebameeldivate emotsioonide eest, The Maladaptive Coping modes represent the child’s attempts to adapt to living with unmet emotional needs in a harmful environment. These coping modes were adaptive when the patient was a young child, but they are often maladaptive in the wider adult world (p. 275), Schema therapy distinguishes three types of maladaptive coping modes: The detached protector, the Compliant surrender and the Overcompensator modes. These modes correspond to the maladaptive coping styles of schema avoidance, surrender and overcompensation, respectively. In contrast to the coping styles, however, which focus solely on coping behaviors, the coping modes are emotional states that involve emotions, cognitions,and behavioral responses that are active at a given moment, when early maladaptive schemas have been triggered (p. 59), Maladaptive Coping Modes, a third category of mode, are defined by an overuse of unhealthy coping styles (fight –overcompensation; flight – avoidance; or freeze – surrender). All have the goal of protecting the person from experiencing pain, anxiety, or fear (p. 7)"
    },
    {
      "term": "düsfunktsionaalne toimetuleku olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/d%C3%BCsfunktsionaalne%20toimetuleku%20olek",
      "letter": "d",
      "language": "eesti",
      "synonyms": [
        "düsfunktsionaalne kaitseolek"
      ],
      "definition": "üks kategooria skeemi olekutest, mille eesmärk on psühholoogiliselt kaitsta aktiveerunud skeemiga kaasnevate ebameeldivate emotsioonide eest, The Maladaptive Coping modes represent the child’s attempts to adapt to living with unmet emotional needs in a harmful environment. These coping modes were adaptive when the patient was a young child, but they are often maladaptive in the wider adult world (p. 275), Schema therapy distinguishes three types of maladaptive coping modes: The detached protector, the Compliant surrender and the Overcompensator modes. These modes correspond to the maladaptive coping styles of schema avoidance, surrender and overcompensation, respectively. In contrast to the coping styles, however, which focus solely on coping behaviors, the coping modes are emotional states that involve emotions, cognitions,and behavioral responses that are active at a given moment, when early maladaptive schemas have been triggered (p. 59), Maladaptive Coping Modes, a third category of mode, are defined by an overuse of unhealthy coping styles (fight –overcompensation; flight – avoidance; or freeze – surrender). All have the goal of protecting the person from experiencing pain, anxiety, or fear (p. 7)"
    },
    {
      "term": "early adaptive schema",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/early%20adaptive%20schema",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "lai, kõikehõlmav enda ja oma suhete kohta käiv emotsioonidest, kognitsioonidest ja kehalistest aistingutest koosnev muster, mis kujuneb varases arengus lapse baasiliste emotsionaalsete vajaduste rahuldamisel (esmaselt) oluliste täiskasvanute poolt, are hypothesized to develop when the core emotional needs of a child are met early in life by primary caregivers"
    },
    {
      "term": "early maladaptive schema",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/early%20maladaptive%20schema",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "lai, kõikehõlmav enda ja oma suhete kohta käiv mälestustest, emotsioonidest, kognitsioonidest ja kehalistest aistingutest koosnev muster, mis on kujunenud lapsepõlves või noorukieas ning kinnistunud läbi elu ning on olulisel määral düsfunktsionaalne, a broad, pervasive theme or pattern regarding oneself and one’s relationships with others, comprised of memories, emotions, cognitions, and bodily sensations, developed during childhood or adolescence, elaborated throughout one’s lifetime and dysfunctional to a significant degree, Lapsepõlves on sellised skeemid tihti kohanemiseks vajalikud, kuid täiskasvanueas muutuvad need kohanemist raskendavaks ja toimetulekut piiravaks ning on enamasti inimese enda poolt teadvustamata., Maladaptive schemas are psychological constructs that include beliefs we have about ourselves, the world, and other people, which result from interactions of unmet core childhood needs, innate temperament, and early environment. These schemas often have an adaptive role in childhood (e.g., in terms of survival in an abusive situation – it engenders more hope for children if they believe they are defective as opposed to the adult being defective). By adulthood, maladaptive schemas are inaccurate, dysfunctional, and limiting, although strongly held and frequently not in the person’s conscious awareness., Pervasive life patterns which influence cognitions, emotions, memories, social perceptions and interaction and behavior patterns."
    },
    {
      "term": "ebapädevus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/ebap%C3%A4devus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [
        "ebakompetentsus"
      ],
      "definition": "asjatundmatus mingil alal, mingis küsimuses või üksikasjas"
    },
    {
      "term": "ebastabiilsus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/ebastabiilsus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [
        "hüljatus"
      ],
      "definition": "eeldus, et kõik elu jooksul loodud tähtsad suhted katkevad ning sellest tulenev pidev mure hülgamise ees, the feeling that important relationships which they have formed will never last and thus they are constantly worried about being abandoned by others, The perceived instability or unreliability of those available for support and connection. Involves the sense that significant others will not be able to continue providing emotional support, connection, strength, or practical protection because they are emotionally unstable and unpredictable (e.g., have angry outbursts), unreliable, or present only erratically; because they will die imminently; or because they will abandon the individual in favor of someone better., The patient expects that significant others will eventually abandon him. Others are unreliable and unpredictable in their support and connection. When the patient feels abandoned he switches between feelings of anxiety, grief and anger."
    },
    {
      "term": "edukus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/edukus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "tegutsemise või toimimise tulemuslikkus, edukas-olemine"
    },
    {
      "term": "eemaldunud eneserahustaja olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eemaldunud%20eneserahustaja%20olek",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, milles olles üritatakse rahustada või leevendada oma negatiivseid emotsioone, tehes seda läbi kompulsiivsete, korduvate või sõltuvuslike tegevuste nagu näiteks narkootikumide või alkoholi tarvitamise, söömasööstude, kompulsiivse ostlemise või mängurluse või internetisõltuvuse läbi, The Detached Self-soother mode involves attempts to calm or soothe one's feelings through compulsive, repetitive, or addictive behaviors, such as drug or alcohol use, binge eating, compulsive shopping, compulsive gambling, or internet addiction."
    },
    {
      "term": "eemaldunud kaitsja olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eemaldunud%20kaitsja%20olek",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mida iseloomustab emotsionaalne vältimine ja milles olles inimene eitab tundeid ja probleeme, on emotsionaalselt eraldunud, distantseerunud, tuim või intellektualiseeriv ja üliratsionaalne, a state of emotional avoidance. When in this state, patients deny feelings and problems, are emotionally detached, distant, and numb, or are intellectualized and super-rational, The Detached Protector withdraws psychologically from the pain of the schema by emotionally detaching, abusing substances, self-stimulating, avoiding people, or utilizing other forms of escape. The function of this mode is to cut off emotional needs, disconnect from others, and behave submissively in order to avoid punishment., A mode that ranges from a person being “spacey,” or briefly losing focus in an interaction, to severe dissociation."
    },
    {
      "term": "eluterve endast lähtumine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eluterve%20endast%20l%C3%A4htumine",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "eeldus, et iseendale olulised väärtused on tähtsad vajaduseta teistelt heakskiitu pälvida, valuing what matters to oneself without the need of having others notice"
    },
    {
      "term": "eluterve enesearmastus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eluterve%20enesearmastus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "võime hoida tasakaalu enda vajaduste arvestamise ja teiste abistamise vahel, ability to healthily balance considering one's own needs and helping others"
    },
    {
      "term": "eluterve enesekontroll",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eluterve%20enesekontroll",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "võime järgida pikaajalisi eesmärke, mis nõuavad püsivust ja vahetu kasu saamise edasilükkamist, ability to follow long-term goals that require delayed gratification and persistence"
    },
    {
      "term": "eluterve eneseusaldus ja kompetentsus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eluterve%20eneseusaldus%20ja%20kompetentsus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "eeldus, et ollakse võimeline iseseisvalt igapäevaeluga toime tulema, feeling capable of independently coping with everyday life"
    },
    {
      "term": "eluterved piirid ja küps eneseküllasus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eluterved%20piirid%20ja%20k%C3%BCps%20enesek%C3%BCllasus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "eakohane sõltumatus oma vanematest, having developed a healthy independence from one's parents"
    },
    {
      "term": "emotion constriction",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotion%20constriction",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "emotsioonide ja nendega seotud spontaansete ilmingute ja käitumisimpulsside liigne allasurumine või loomulike impulsside ignoreerimine eeldatava häbi/piinlikkuse tõttu, the excessive inhibition or disconnection of spontaneous emotion, action, or expression, due to an underlying shame/embarrassment, It involves inhibition of both negative impulses (e.g., anger, aggression, sadness) and positive impulses (e.g., joy, affection, sexual excitement, play), difficulty expressing vulnerability or communicating freely about one’s thoughts, feelings, and needs, or excessive emphasis on rationality over emotions. There may be a sense of pride in being “a rational person”, or the moral/ethical value in one’s stoicism., See hõlmab nii “negatiivsete” emotsioonide ja impulsside (nt viha, agressiivsus või kurbus) kui ka “positiivsete” emotsioonide ja impulsside (näiteks rõõm, imetlus, seksuaalne erutus, mängulisus) allasurumist, haavatavuse näitamise või oma mõtete, tunnete ja vajaduste vaba väljendamise raskusi või ratsionaalsuse liigset rõhutamist emotsioonide kahjuks. Inimene võib uhkustada sellega, et on \"ratsionaalne\" või rõhutada omaenda stoilisuse moraalset/eetilist väärtust., varasemalt emotsionaalse pärsituse skeem"
    },
    {
      "term": "emotional consideration",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotional%20consideration",
      "letter": "e",
      "language": "inglise",
      "synonyms": [
        "empathic consideration"
      ],
      "definition": "teiste vajaduste ja tunnete suhtes hoolivuse väljendamine, showing consideration for other's needs and feelings"
    },
    {
      "term": "emotional deprivation",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotional%20deprivation",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et vajadus ja soov emotsionaalse toe järele jääb vastamata, the expectation that one’s desire for a normal degree of emotional support will not be adequately met by others, Kolm peamist deprivatsiooni vormi on hoolitsuse puudus (tähelepanu, kiindumus, soojus, või koosolemine); empaatia puudus (mõistmine, kuulamine, eneseavamine, tunnete jagamine teistega); kaitstuse puudus (teistepoolne tugi, juhendamine ja suunamine)., Inimesed selle skeemiga räägivad oma lapsepõlvest tavaliselt kui tavalisest ja probleemitust, kuid tegelikkuses ei kogenud nad soojust ja armastavat hoolt, ja nad ei tundnud end kunagi tõeliselt armastatud, hoituna ja turvaliselt. Neil on keeruline saada aru ja tunnistada seda endale, kui teised inimesed hoolivad nendest., The patient expects that others will never or not adequately meet his primary emotional needs (e.g. for support, nurturance, empathy, and protection). He feels isolated and lonely., The three major forms of deprivation are: A. Deprivation of Nurturance: Absence of attention, affection, warmth, or companionship; B. Deprivation of Empathy: Absence of understanding, listening, self-disclosure, or mutual sharing of feelings from others. C. Deprivation of Protection: Absence of strength, direction, or guidance from others., Patient with this schema typically refer to their childhood as a smooth and ok one, but they commonly did not experience much warmth or loving care, and did not feel truly safe, loved, or comforted. They seem somehow unable to perceive and acknowledge when others like them., üks varajastest mittekohastumustlikest skeemidest"
    },
    {
      "term": "emotional fulfillment",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotional%20fulfillment",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et tuntakse täielikku emotsionaalset toetust lähisuhetes, feeling full emotional support in intimate relationships"
    },
    {
      "term": "emotional inhibition",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotional%20inhibition",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "igasugune emotsiooni või impulsi spontaanse väljendamise allasurumine või selle täielik puudumine vältimaks teiste hukkamõistu, häbitunnet või kontrolli kaotamist impulsside üle, the excessive inhibition of spontaneous action, feeling, or communication, usually to avoid disapproval by others, feelings of shame, or losing control of one’s impulses, Pidurdatus avaldub tavapäraselt järgmistes valdkondades: (a) viha ja agressioon; (b) postiivsed impulsid (nt rõõm, kiindumus, seksuaalne erutatus, mängulisus); (c) haavatavuse väljendamine või oma tunnete, vajaduste jms vahetu ja vaba väljendamine; (d) emotsioonide eiramine, alahindamine ja ratsionaalsuse ülehindamine, -tähtsustamine., The most common areas of inhibition involve: (a) inhibition of anger and aggression; (b) inhibition of positive impulses (e.g., joy, affection, sexual excitement, play); (c) difficulty expressing vulnerability or communicating freely about one’s feelings, needs, and so forth; or (d) excessive emphasis on rationality while disregarding emotions (p. 17)"
    },
    {
      "term": "emotional openness and spontaneity",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotional%20openness%20and%20spontaneity",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "tuntakse end mugavalt tundeid teistele väljendades, being comfortable in expressing feelings to others"
    },
    {
      "term": "emotsionaalne avatus ja spontaansus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotsionaalne%20avatus%20ja%20spontaansus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "tuntakse end mugavalt tundeid teistele väljendades, being comfortable in expressing feelings to others"
    },
    {
      "term": "emotsionaalne deprivatsioon",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotsionaalne%20deprivatsioon",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "eeldus, et vajadus ja soov emotsionaalse toe järele jääb vastamata, the expectation that one’s desire for a normal degree of emotional support will not be adequately met by others, Kolm peamist deprivatsiooni vormi on hoolitsuse puudus (tähelepanu, kiindumus, soojus, või koosolemine); empaatia puudus (mõistmine, kuulamine, eneseavamine, tunnete jagamine teistega); kaitstuse puudus (teistepoolne tugi, juhendamine ja suunamine)., Inimesed selle skeemiga räägivad oma lapsepõlvest tavaliselt kui tavalisest ja probleemitust, kuid tegelikkuses ei kogenud nad soojust ja armastavat hoolt, ja nad ei tundnud end kunagi tõeliselt armastatud, hoituna ja turvaliselt. Neil on keeruline saada aru ja tunnistada seda endale, kui teised inimesed hoolivad nendest., The patient expects that others will never or not adequately meet his primary emotional needs (e.g. for support, nurturance, empathy, and protection). He feels isolated and lonely., The three major forms of deprivation are: A. Deprivation of Nurturance: Absence of attention, affection, warmth, or companionship; B. Deprivation of Empathy: Absence of understanding, listening, self-disclosure, or mutual sharing of feelings from others. C. Deprivation of Protection: Absence of strength, direction, or guidance from others., Patient with this schema typically refer to their childhood as a smooth and ok one, but they commonly did not experience much warmth or loving care, and did not feel truly safe, loved, or comforted. They seem somehow unable to perceive and acknowledge when others like them., üks varajastest mittekohastumustlikest skeemidest"
    },
    {
      "term": "emotsionaalne kammitsetus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotsionaalne%20kammitsetus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "emotsioonide ja nendega seotud spontaansete ilmingute ja käitumisimpulsside liigne allasurumine või loomulike impulsside ignoreerimine eeldatava häbi/piinlikkuse tõttu, the excessive inhibition or disconnection of spontaneous emotion, action, or expression, due to an underlying shame/embarrassment, It involves inhibition of both negative impulses (e.g., anger, aggression, sadness) and positive impulses (e.g., joy, affection, sexual excitement, play), difficulty expressing vulnerability or communicating freely about one’s thoughts, feelings, and needs, or excessive emphasis on rationality over emotions. There may be a sense of pride in being “a rational person”, or the moral/ethical value in one’s stoicism., See hõlmab nii “negatiivsete” emotsioonide ja impulsside (nt viha, agressiivsus või kurbus) kui ka “positiivsete” emotsioonide ja impulsside (näiteks rõõm, imetlus, seksuaalne erutus, mängulisus) allasurumist, haavatavuse näitamise või oma mõtete, tunnete ja vajaduste vaba väljendamise raskusi või ratsionaalsuse liigset rõhutamist emotsioonide kahjuks. Inimene võib uhkustada sellega, et on \"ratsionaalne\" või rõhutada omaenda stoilisuse moraalset/eetilist väärtust., varasemalt emotsionaalse pärsituse skeem"
    },
    {
      "term": "emotsionaalne pidurdatus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotsionaalne%20pidurdatus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "igasugune emotsiooni või impulsi spontaanse väljendamise allasurumine või selle täielik puudumine vältimaks teiste hukkamõistu, häbitunnet või kontrolli kaotamist impulsside üle, the excessive inhibition of spontaneous action, feeling, or communication, usually to avoid disapproval by others, feelings of shame, or losing control of one’s impulses, Pidurdatus avaldub tavapäraselt järgmistes valdkondades: (a) viha ja agressioon; (b) postiivsed impulsid (nt rõõm, kiindumus, seksuaalne erutatus, mängulisus); (c) haavatavuse väljendamine või oma tunnete, vajaduste jms vahetu ja vaba väljendamine; (d) emotsioonide eiramine, alahindamine ja ratsionaalsuse ülehindamine, -tähtsustamine., The most common areas of inhibition involve: (a) inhibition of anger and aggression; (b) inhibition of positive impulses (e.g., joy, affection, sexual excitement, play); (c) difficulty expressing vulnerability or communicating freely about one’s feelings, needs, and so forth; or (d) excessive emphasis on rationality while disregarding emotions (p. 17)"
    },
    {
      "term": "emotsionaalne rahuldatus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/emotsionaalne%20rahuldatus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "eeldus, et tuntakse täielikku emotsionaalset toetust lähisuhetes, feeling full emotional support in intimate relationships"
    },
    {
      "term": "empaatiline konfronteerumine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/empaatiline%20konfronteerumine",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "terapeutiline viis tegeleda kaitseolekutega, olles empaatiline nende kujunemise biograafiliste põhjuste suhtes, samas vastandudes nende väljendumisviisidele käitumises, the therapist’s approach to addressing maladaptive coping modes and associated behaviors, with empathy for how they developed biographically, balanced by confronting these modes and behaviors as needing to change for the patient to have a healthy life, Empathic confrontation involves showing empathy for the patients’ schemas when they arise toward the therapist, while showing patients that their reactions to the therapist are often distorted or dysfunctional in ways that reflect their schemas and coping styles., In empathic confrontation, the therapist confronts the patient on his maladaptive behaviors and cognitions, but in an empathic, non-judgmental way. This technique only works if the therapist has genuine compassion for the patient. Empathic confrontation can be used to confront the patient with his self-defeating behavior outside or inside of the therapy session."
    },
    {
      "term": "empaatiline tähelepanelikkus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/empaatiline%20t%C3%A4helepanelikkus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "teiste vajaduste ja tunnete suhtes hoolivuse väljendamine, showing consideration for other's needs and feelings"
    },
    {
      "term": "empathic confrontation",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/empathic%20confrontation",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "terapeutiline viis tegeleda kaitseolekutega, olles empaatiline nende kujunemise biograafiliste põhjuste suhtes, samas vastandudes nende väljendumisviisidele käitumises, the therapist’s approach to addressing maladaptive coping modes and associated behaviors, with empathy for how they developed biographically, balanced by confronting these modes and behaviors as needing to change for the patient to have a healthy life, Empathic confrontation involves showing empathy for the patients’ schemas when they arise toward the therapist, while showing patients that their reactions to the therapist are often distorted or dysfunctional in ways that reflect their schemas and coping styles., In empathic confrontation, the therapist confronts the patient on his maladaptive behaviors and cognitions, but in an empathic, non-judgmental way. This technique only works if the therapist has genuine compassion for the patient. Empathic confrontation can be used to confront the patient with his self-defeating behavior outside or inside of the therapy session."
    },
    {
      "term": "empathic consideration",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/empathic%20consideration",
      "letter": "e",
      "language": "inglise",
      "synonyms": [
        "emotional consideration"
      ],
      "definition": "teiste vajaduste ja tunnete suhtes hoolivuse väljendamine, showing consideration for other's needs and feelings"
    },
    {
      "term": "empowerment imagery",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/empowerment%20imagery",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "kogemuslik kujutlustehnika paariskeemiteraapias, mille eesmärk on julgustada paarisuhte vältivat või alistuvat partnerit ennast kehtestama läbi samastumise kellegi võimsa inimese või olendiga, the imagery with the goal to energize the client enabling them to speak up towards the partner from their assertive side to overcome avoidant behavior"
    },
    {
      "term": "enesekaastunne",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/enesekaastunne",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "oma eksimuste suhtes andestav olemine, forgiving oneself for mistakes"
    },
    {
      "term": "enesele suunatud sallimatu karistavus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/enesele%20suunatud%20sallimatu%20karistavus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "varane mittekohastumuslik skeem, mida iseloomustavad vaenulikkus oma vigade, kannatuse ja ebatäiuslikkuse suhtes, enesesüüdistus ning enesele esitatavad kõrged ja jäigad ootused, mille suhtes eksimine on andestamatu, self-directed hypercriticalness towards one’s own mistakes, suffering, or imperfections. Involves a belief that one should be punished or held accountable in some way for failing to meet expectations, a tendency to ignore extenuating circumstances, and an excessive sense of responsibility leading to self-blame, self-directed anger, and difficulty forgiving oneself."
    },
    {
      "term": "eneseohverdus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eneseohverdus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [
        "enesesalgamine",
        "eneseohverdamine"
      ],
      "definition": "oma isiklikest hüvedest teiste kasuks loobumine"
    },
    {
      "term": "enesetähtsustamine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eneset%C3%A4htsustamine",
      "letter": "e",
      "language": "eesti",
      "synonyms": [
        "grandioossus"
      ],
      "definition": "eeldus, et ollakse teistest üle, omatakse eriõiguseid ja ollakse väärt erikohtlemist ega lähtuta vastastikususe põhimõttest inimestevahelises suhtluses, The belief that one is superior to other people; entitled to special rights and privileges; or not bound by the rules of reciprocity that guide normal social interaction, Skeemi iseloomustab kindel nõudmine teha ja omada, mida soovitakse sõltumata reaalsetest võimalustest, sellest mida teised peavad mõistlikuks või missugused on nende soovidega kaasnevad kulutused teistele. Mõnedel juhtudel sisaldab skeem võimendatud rõhutatust üleolekule (nt kuuluvust kõige edukamate, kuulsamate, rikkamate hulka) - eesmärgiga saavutada võimu ja kontrolli (esmaselt oluline ei ole tähelepanu või heakskiit). Teatud olukordades väljendub see äärmuslikus võistluslikkuses või domineerimise soovis teiste üle ühel või teisel moel - oma võimu kehtestamises, oma vaadete ja tõekspidamiste pealesurumises või teiste käitumise kontrollimises oma soove silmas pidades - empaatia või huvita teiste tunnete või vajaduste suhtes, Often involves insistence that one should be able to do or have whatever one wants, regardless of what is realistic, what others consider reasonable, or the cost to others; or an exaggerated focus on superiority (e.g., being among the most successful, famous, wealthy) in order to achieve power or control (not primarily for attention or approval). Sometimes includes excessive competitiveness toward or domination of others: asserting one’s power, forcing one’s point of view, or controlling the behavior of others in line with one’s own desires without empathy or concern for others’ needs or feelings"
    },
    {
      "term": "enmeshment",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/enmeshment",
      "letter": "e",
      "language": "inglise",
      "synonyms": [
        "undeveloped self"
      ],
      "definition": "ülemäärane emotsionaalne seotus ja lähedus ühe või enama olulise lähedasega (sageli vanematega) ootuspärase sotsiaalse arengu või täieliku iseseisvumise ja selge identiteedi kujunemise arvelt, excessive emotional involvement and closeness with one or more significant others (often parents) at the expense of full individuation or normal social development, Sageli esineb veendumus, et vähemalt üks üleseotud isikutest ei tule toime või ei saa olla õnnelik teise pideva toeta. Võib tunduda, et ollakse rõhutud, alla surutud või teistega sulandunud ja selge individuaalse identiteedita. Sageli kogetakse sisemist tühjust, suuna ja eesmärkide puudumist, takerdumise ja põhja vajumise tundeid, äärmuslikematel juhtudel seatakse kahtluse alla elu ja eksistentsi mõttekus, Often involves the belief that at least one of the enmeshed individuals cannot survive or be happy without the constant support of the other. May also include feelings of being smothered by or fused with others or insufficient individual identity. Often experienced as a feeling of emptiness and foundering, having no direction, or in extreme cases questioning one’s existence"
    },
    {
      "term": "ennastpiitsutava ülekontrollija olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/ennastpiitsutava%20%C3%BClekontrollija%20olek",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "overcompensates for fear of attack or punishment by punishing and blaming oneself, with the aim of restoring the illusion of control, self-punishment or deprivation may also function as an attempt at self-improvement, to appease, to reduce the risk of being humiliated or punished (either by others or their own internal Critic), to increase predictability and perceived control over suffering and pain, or to atone for unresolved guilt or shame, üks düsfunktsionaalsetest toimetulekuolekutest, mida iseloomustab enda karistamine või süüdistamine hirmust saada rünnatud või karistatud eesmärgiga taastada illusioon kontrollist"
    },
    {
      "term": "enraged child mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/enraged%20child%20mode",
      "letter": "e",
      "language": "inglise",
      "synonyms": [],
      "definition": "lapse olek, milles tuntakse raevu, mis päädib kontrollimatu teisi või asju kahjustava agressiivse käitumisega, Experiences intense feelings of rage that result in uncontrolled aggression, such as hurting people or damaging objects. The displayed aggression is out of control and aims to destroy or exterminate the aggressor, sometimes literally. The patient may display the affect of an enraged or uncontrollable child, acting out or screaming at an (alleged) perpetrator., The patient feels enraged for the same reason as the Angry Child, but loses control. This is expressed in offensive and injurious actions toward people and objects, in the same way as a small child hurts his parents."
    },
    {
      "term": "entitlement",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/entitlement",
      "letter": "e",
      "language": "inglise",
      "synonyms": [
        "grandiosity"
      ],
      "definition": "eeldus, et ollakse teistest üle, omatakse eriõiguseid ja ollakse väärt erikohtlemist ega lähtuta vastastikususe põhimõttest inimestevahelises suhtluses, The belief that one is superior to other people; entitled to special rights and privileges; or not bound by the rules of reciprocity that guide normal social interaction, Skeemi iseloomustab kindel nõudmine teha ja omada, mida soovitakse sõltumata reaalsetest võimalustest, sellest mida teised peavad mõistlikuks või missugused on nende soovidega kaasnevad kulutused teistele. Mõnedel juhtudel sisaldab skeem võimendatud rõhutatust üleolekule (nt kuuluvust kõige edukamate, kuulsamate, rikkamate hulka) - eesmärgiga saavutada võimu ja kontrolli (esmaselt oluline ei ole tähelepanu või heakskiit). Teatud olukordades väljendub see äärmuslikus võistluslikkuses või domineerimise soovis teiste üle ühel või teisel moel - oma võimu kehtestamises, oma vaadete ja tõekspidamiste pealesurumises või teiste käitumise kontrollimises oma soove silmas pidades - empaatia või huvita teiste tunnete või vajaduste suhtes, Often involves insistence that one should be able to do or have whatever one wants, regardless of what is realistic, what others consider reasonable, or the cost to others; or an exaggerated focus on superiority (e.g., being among the most successful, famous, wealthy) in order to achieve power or control (not primarily for attention or approval). Sometimes includes excessive competitiveness toward or domination of others: asserting one’s power, forcing one’s point of view, or controlling the behavior of others in line with one’s own desires without empathy or concern for others’ needs or feelings"
    },
    {
      "term": "eraldatus ja tõrjutus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/eraldatus%20ja%20t%C3%B5rjutus",
      "letter": "e",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on eeldus, et vajadus turvalisuse, stabiilsuse, hoole, empaatia, emotsioonide jagamise, aksepteerimise ning austuse järele jääb ootuspärasel viisil vastamata, the expectation that one’s needs for security, safety, stability, nurturance, empathy, sharing of feelings, acceptance, and respect will not be met in a predictable manner, Selle valdkonna skeemid kujunevad sageli siis, kui varane kasvukeskkond on eraldunud, eemalolev, külm, tõrjuv, vägivaldne, plahvatuslik, ennustamatu, kuritarvitav"
    },
    {
      "term": "failure",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/failure",
      "letter": "f",
      "language": "inglise",
      "synonyms": [
        "fault"
      ],
      "definition": "tehnilise seadme või süsteemi töötamise häire, korrast ära olek"
    },
    {
      "term": "fear of losing control",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/fear%20of%20losing%20control",
      "letter": "f",
      "language": "inglise",
      "synonyms": [],
      "definition": "the excessive inhibition or disconnection of spontaneous emotion, action, or expression, due to a fear that one would otherwise lose control of their impulses resulting in dire consequences, emotsioonide ja nendega seotud spontaansete ilmingute ja käitumisimpulsside või reaktsioonide liigne allasurumine või ignoreerimine hirmust kaotada kontrolli impulsside üle, mis ähvardab “kohutavate” tagajärgedega, See võib hõlmata hirmu, et emotsioonid võivad inimese täiesti üle ujutada (nt paanika/hirm või meeleheide), hirmu teiste reaktsioonide pärast (nt lahkuminek, hülgamine, mõnitamine või hukkamõist), hirmu ennast/teisi kahjustada (nt käitudes agressiivsete impulsside või obsessiivsete mõtete ajel või kahjustada oma tervist – südant, vererõhku tõsta jne) või hirmu \"kiusatusele järele anda\" (näiteks mõttetu raha kulutamise või ülesöömise näol). Võib olla liigne mure oma seisundi ja teistele jäetava mulje pärast. See ärevuse / düsregulatsiooni motiiv erineb emotsionaalse kammitsetuse skeemile iseloomulikust häbi / uhkuse motiivist., varasemalt emotsionaalse pärsituse skeem, üks varajastest mittekohastumuslikest skeemidest"
    },
    {
      "term": "flaggelating overcontroller mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/flaggelating%20overcontroller%20mode",
      "letter": "f",
      "language": "inglise",
      "synonyms": [],
      "definition": "overcompensates for fear of attack or punishment by punishing and blaming oneself, with the aim of restoring the illusion of control, self-punishment or deprivation may also function as an attempt at self-improvement, to appease, to reduce the risk of being humiliated or punished (either by others or their own internal Critic), to increase predictability and perceived control over suffering and pain, or to atone for unresolved guilt or shame, üks düsfunktsionaalsetest toimetulekuolekutest, mida iseloomustab enda karistamine või süüdistamine hirmust saada rünnatud või karistatud eesmärgiga taastada illusioon kontrollist"
    },
    {
      "term": "freedom to express valid needs and emotions",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/freedom%20to%20express%20valid%20needs%20and%20emotions",
      "letter": "f",
      "language": "inglise",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus väljendada vabalt oma vajadusi, emotsioone ja mõtteid ja saada selles valideeritud, Having the freedom to express your feelings and basic needs. Expressing ourselves without being scared of negative reactions"
    },
    {
      "term": "funktsionaalne olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/funktsionaalne%20olek",
      "letter": "f",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks kategooria skeemi olekutest, mis sisaldab kohastumuslikke vastuseid täiskasvanuea keskkonnale ning võimet olla kontaktis lapseeast pärit loovate ja mänguliste kogemustega, The adaptive responses to our adult environment and the ability to access creative joyful aspects of childhood., Healthy modes are the modes of the healthy adults and the happy child. In the healthy adult mode, patients are able to view their life and their self in a realistic way. They are able to fulfill their obligations, but at the same time can care for their own needs and well-being. The mode of the happy child is particularly related to fun, joy, and play."
    },
    {
      "term": "grandioossus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/grandioossus",
      "letter": "g",
      "language": "eesti",
      "synonyms": [
        "suurejoonelisus"
      ],
      "definition": "uhkus ja võimsus, oma mõjususega muljet avaldav olek"
    },
    {
      "term": "grandiosity",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/grandiosity",
      "letter": "g",
      "language": "inglise",
      "synonyms": [
        "entitlement"
      ],
      "definition": "eeldus, et ollakse teistest üle, omatakse eriõiguseid ja ollakse väärt erikohtlemist ega lähtuta vastastikususe põhimõttest inimestevahelises suhtluses, The belief that one is superior to other people; entitled to special rights and privileges; or not bound by the rules of reciprocity that guide normal social interaction, Skeemi iseloomustab kindel nõudmine teha ja omada, mida soovitakse sõltumata reaalsetest võimalustest, sellest mida teised peavad mõistlikuks või missugused on nende soovidega kaasnevad kulutused teistele. Mõnedel juhtudel sisaldab skeem võimendatud rõhutatust üleolekule (nt kuuluvust kõige edukamate, kuulsamate, rikkamate hulka) - eesmärgiga saavutada võimu ja kontrolli (esmaselt oluline ei ole tähelepanu või heakskiit). Teatud olukordades väljendub see äärmuslikus võistluslikkuses või domineerimise soovis teiste üle ühel või teisel moel - oma võimu kehtestamises, oma vaadete ja tõekspidamiste pealesurumises või teiste käitumise kontrollimises oma soove silmas pidades - empaatia või huvita teiste tunnete või vajaduste suhtes, Often involves insistence that one should be able to do or have whatever one wants, regardless of what is realistic, what others consider reasonable, or the cost to others; or an exaggerated focus on superiority (e.g., being among the most successful, famous, wealthy) in order to achieve power or control (not primarily for attention or approval). Sometimes includes excessive competitiveness toward or domination of others: asserting one’s power, forcing one’s point of view, or controlling the behavior of others in line with one’s own desires without empathy or concern for others’ needs or feelings"
    },
    {
      "term": "haavatava lapse olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/haavatava%20lapse%20olek",
      "letter": "h",
      "language": "eesti",
      "synonyms": [],
      "definition": "lapse olek, milles kogetakse düsfoorilisi ja ärevaid tundeid, eelkõige hirmu, kurbust ja abitust vastusena ühe või mitme varase mittekohastumusliku skeemi aktiveerumisele, experiences of dysphoric or anxious affect, especially fear, sadness, and helplessness, when “in touch” with associated schemas, This is the mode that usually experiences most of the core schemas. When we are in a Vulnerable Child mode, we are like lost or wounded children. We may appear sad and hopeless, or be anxious, overwhelmed, and helpless. As the name implies, we often feel weak, vulnerable, exposed, and defenseless. The Vulnerable Child is a remnant of the time when the person was a child needing the care of adults in order to survive, but was not getting that care., The patient believes that nobody will fulfill his needs and that everyone will eventually abandon him. He mistrusts others and believes that they will abuse him. He feels worthless and expects rejection. He is ashamed of himself and he often feels excluded. He behaves like a small, vulnerable child that clings to the therapist for help, because he feels lonely and believes there is danger everywhere."
    },
    {
      "term": "haavatavus ohu või haigestumise suhtes",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/haavatavus%20ohu%20v%C3%B5i%20haigestumise%20suhtes",
      "letter": "h",
      "language": "eesti",
      "synonyms": [],
      "definition": "eeldus, et enda või lähedasega on juhtumas katastroof, mille toimumist ei ole võimalik ära hoida, exaggerated fear that imminent catastrophe will strike at any time and that one will be unable to prevent it, Vulnerability to Harm or Illness Schema is described as follows: The patient believes that imminent catastrophe will strike him and significant others, and that he is unable to prevent this., Hirm on tüüpiliselt seotud ühe või enama valdkonnaga järgnevatest: (A) tervise seisundiga seotud katastroof (nt infarkt, AIDS); (B) emotsionaalne katastroof (nt hirm hulluks minemise ees); (C) mingi välise sündmuse toimumisega seotud katastroof (nt tõrked lifti töös, rünnaku ohvriks sattumine, lennuõnnetusse sattumine, vm)., Fears focus on one or more of the following: (A) Medical catastrophes (e.g., heart attacks, AIDS); (B) Emotional catastrophes (e.g., going crazy); (C) External catastrophes (e.g., elevators collapsing, victimization by criminals, airplane crashes, earthquakes)"
    },
    {
      "term": "happy child mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/happy%20child%20mode",
      "letter": "h",
      "language": "inglise",
      "synonyms": [],
      "definition": "lapse olek, milles tuntakse end rõõmsa, rahuloleva ja armastatuna, väljendatakse end spontaanselt ja mänguliselt ning see olek ei ole seotud ühegi varase mittekohastumusliku skeemiga, sest baasilised emotsionaalsed vajadused on ootuspäraselt rahuldatud, When in this mode, people feel at peace because their core emotional needs are currently met. They experience others as loving and appropriately protective, and they feel connected to them, nurtured, and validated. Because of this sense of security, they feel fulfilled, worthwhile, and self-confident, and are able to have a sense of optimism, spontaneity, and contentment. The Contented Child mode represents the capacity to experience and express spontaneity, glee, and playful happiness., The Happy Child Mode is a resource for playful and enjoyable activities, especially in social networks."
    },
    {
      "term": "heakskiidu otsimine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/heakskiidu%20otsimine",
      "letter": "h",
      "language": "eesti",
      "synonyms": [],
      "definition": "eeldus, et teiste tunnustuse, heakskiidu ja tähelepanu otsimine ning sobitumine on oluline iseolemise arvelt, excessive emphasis on gaining approval, recognition, or attention from other people or on fitting in at the expense of developing a secure and true sense of self, Enesest lugupidamine ja väärtuse tunnetamine on sõltuv teistelt saadud tagasisidest pigem kui iseolemise valikust. Võib sisaldada staatuse, välimuse, sotsiaalse aktsepteerituse, raha või saavutuste ületähtsustamist heakskiidu, imetluse või tähelepanu vahenditena (ei ole primaarselt seotud võimu või kontrolliga). Sageli päädib sellega, et elu olulisi küsimusi puudutavad valikud ja otsused ei ole autentsed, ollakse rahulolematu või ülitundlik (võimaliku) tõrjumise suhtes., One’s sense of esteem is dependent primarily on the reactions of others rather than on one’s own natural inclinations. Sometimes includes an overemphasis on status, appearance, social acceptance, money, or achievement as means of gaining approval, admiration, or attention (not primarily for power or control). Frequently results in major life decisions that are inauthentic or unsatisfying or in hypersensitivity to rejection."
    },
    {
      "term": "healthy adult mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/healthy%20adult%20mode",
      "letter": "h",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks funktsionaalsetest olekutest, mida iseloomustab toimetulevus ja tugevus; hõlmab kohastumuslikke vastuseid ümbritsevale keskkonnale, mis on vajalikud selleks, et täide viia täiskasvanud inimese igapäevaseid tegevusi nagu töölkäimine, vanemlus, vastutuse võtmine, tegevustele ja inimestele pühendumine, ning püüdleb täiskasvanulikke naudinguid nagu intellektuaalsed, esteetilised, kultuurilised huvid, seks, tervise hoidmine ja sportlikud tegevused, the part of the self that is capable, strong, and well-functioning which includes those functional cognitions and behaviors that are needed to carry out appropriate adult functions such as working, parenting, taking responsibility, and committing to both people and actions. This part of the self is also the one that pursues pleasurable adult activities such as intellectual, aesthetic, and cultural interests, sex, health maintenance, and athletic activities"
    },
    {
      "term": "healthy boundaries - developed self",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/healthy%20boundaries%20-%20developed%20self",
      "letter": "h",
      "language": "inglise",
      "synonyms": [],
      "definition": "eakohane sõltumatus oma vanematest, having developed a healthy independence from one's parents"
    },
    {
      "term": "healthy mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/healthy%20mode",
      "letter": "h",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks kategooria skeemi olekutest, mis sisaldab kohastumuslikke vastuseid täiskasvanuea keskkonnale ning võimet olla kontaktis lapseeast pärit loovate ja mänguliste kogemustega, The adaptive responses to our adult environment and the ability to access creative joyful aspects of childhood., Healthy modes are the modes of the healthy adults and the happy child. In the healthy adult mode, patients are able to view their life and their self in a realistic way. They are able to fulfill their obligations, but at the same time can care for their own needs and well-being. The mode of the happy child is particularly related to fun, joy, and play."
    },
    {
      "term": "healthy self interest – self care",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/healthy%20self%20interest%20%E2%80%93%20self%20care",
      "letter": "h",
      "language": "inglise",
      "synonyms": [],
      "definition": "võime hoida tasakaalu enda vajaduste arvestamise ja teiste abistamise vahel, ability to healthily balance considering one's own needs and helping others"
    },
    {
      "term": "healthy self reliance - competence",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/healthy%20self%20reliance%20-%20competence",
      "letter": "h",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et ollakse võimeline iseseisvalt igapäevaeluga toime tulema, feeling capable of independently coping with everyday life"
    },
    {
      "term": "healthy self-control",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/healthy%20self-control",
      "letter": "h",
      "language": "inglise",
      "synonyms": [
        "healthy self-discipline"
      ],
      "definition": "võime järgida pikaajalisi eesmärke, mis nõuavad püsivust ja vahetu kasu saamise edasilükkamist, ability to follow long-term goals that require delayed gratification and persistence"
    },
    {
      "term": "healthy self-discipline",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/healthy%20self-discipline",
      "letter": "h",
      "language": "inglise",
      "synonyms": [
        "healthy self-control"
      ],
      "definition": "võime järgida pikaajalisi eesmärke, mis nõuavad püsivust ja vahetu kasu saamise edasilükkamist, ability to follow long-term goals that require delayed gratification and persistence"
    },
    {
      "term": "hirm kaotada kontroll",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/hirm%20kaotada%20kontroll",
      "letter": "h",
      "language": "eesti",
      "synonyms": [],
      "definition": "the excessive inhibition or disconnection of spontaneous emotion, action, or expression, due to a fear that one would otherwise lose control of their impulses resulting in dire consequences, emotsioonide ja nendega seotud spontaansete ilmingute ja käitumisimpulsside või reaktsioonide liigne allasurumine või ignoreerimine hirmust kaotada kontrolli impulsside üle, mis ähvardab “kohutavate” tagajärgedega, See võib hõlmata hirmu, et emotsioonid võivad inimese täiesti üle ujutada (nt paanika/hirm või meeleheide), hirmu teiste reaktsioonide pärast (nt lahkuminek, hülgamine, mõnitamine või hukkamõist), hirmu ennast/teisi kahjustada (nt käitudes agressiivsete impulsside või obsessiivsete mõtete ajel või kahjustada oma tervist – südant, vererõhku tõsta jne) või hirmu \"kiusatusele järele anda\" (näiteks mõttetu raha kulutamise või ülesöömise näol). Võib olla liigne mure oma seisundi ja teistele jäetava mulje pärast. See ärevuse / düsregulatsiooni motiiv erineb emotsionaalse kammitsetuse skeemile iseloomulikust häbi / uhkuse motiivist., varasemalt emotsionaalse pärsituse skeem, üks varajastest mittekohastumuslikest skeemidest"
    },
    {
      "term": "hirm saada väärkoheldud",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/hirm%20saada%20v%C3%A4%C3%A4rkoheldud",
      "letter": "h",
      "language": "eesti",
      "synonyms": [
        "usaldamatus"
      ],
      "definition": "eeldus, et saadakse teiste poolt kuritarvitatud, alandatud või muul moel halvasti koheldud ning sellest tulenev pidev kahtlus, et teised teevad neile meelega haiget, people with this schema expect to be abused,humiliated,or in other ways badly treated by others, they are constantly suspicious, because they are afraid of being deliberately harmed., The expectation that others will hurt, abuse, humiliate, cheat, lie, manipulate, or take advantage. Usually involves the perception that the harm is intentional or the result of unjustified and extreme negligence. May include the sense that one always ends up being cheated relative to others or “getting the short end of the stick.”"
    },
    {
      "term": "honeymooning imagery",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/honeymooning%20imagery",
      "letter": "h",
      "language": "inglise",
      "synonyms": [],
      "definition": "kogemuslik kujutlustehnika paariskeemiteraapias, mille eesmärk on aktiveerida partnerite positiivseid mälestusi teineteisest ja taastada nende emotsionaalne ühendus, an imagery exercise with the purpose to induce the couple's emotional connection based on shared good memories"
    },
    {
      "term": "hypercriticalness",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/hypercriticalness",
      "letter": "h",
      "language": "inglise",
      "synonyms": [
        "unrelenting standards"
      ],
      "definition": "eeldus, et peab vastama väga kõrgetele internaliseerunud sisemistele käitumise ja sooritusega seotud standarditele vältimaks (võimaliku) kriitika osaliseks saamist, the underlying belief that one must strive to meet very high internalized standards of behavior and performance, usually to avoid criticism, Typically results in feelings of pressure or difficulty slowing down and in hypercriticalness toward oneself and others. Must involve significant impairment in pleasure, relaxation, health, self-esteem, sense of accomplishment, or satisfying relationships. Unrelenting standards typically present as (a) perfectionism, inordinate attention to detail, or an underestimate of how good one’s own performance is relative to the norm; (b) rigid rules and “shoulds” in many areas of life, including unrealistically high moral, ethical, cultural, or religious precepts; or (c) preoccupation with time and efficiency, the need to accomplish more (p. 17), Tüüpiliselt kaasnevad pingetunne, raskused puhata ja rõõmu tunda, ülim kriitilisus nii iseenda kui teiste suhtes. Kahjustatud on üldine tervis, enesehinnang ja võimelisus eneseteostuseks ning rahuldust pakkuvateks suheteks. Jäigad standardid väljenduvad: (a) täiuslikkuse püüdlusena, ülemäärases tähelepanus detailide suhtes või enese soorituse alahindamises normiga võrreldes; (b) rigiidsetes reeglites ja \"nii peab/on õige\" sõnumites elu erinevate valdkondade kohta, seejuures ebarealistlikult kõrgetes moraalsetes nõudmistes, eetilistes, kultuurilistes või religioossetes ettekirjutustes; või selles, et (c) ollakse üle hõivatud aja kasu ja tõhususe küsimustega vajadusest saavutada enamat."
    },
    {
      "term": "hypervigilance and inhibition",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/hypervigilance%20and%20inhibition",
      "letter": "h",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on äärmuslik keskendumine oma spontaansete tunnete, impulsside, valikute allasurumisele või püüd vastata sisemistele jäikadele reeglitele ja ootustele toimida õigesti sageli oma õnnelikkuse, eneseväljenduse, lõõgastumise, lähedaste suhete või tervise arvelt, excessive emphasis on suppressing one’s spontaneous feelings, impulses, and choices or on meeting rigid, internalized rules and expectations about performance and ethical behavior, often at the expense of happiness, self-expression, relaxation, close relationships, or health, selle valdkonna skeemid võivad kujuneda varases kasvukeskkonnas, mis on sünge, nõudlik, karistav: sooritus, perfektsus, reeglite järgimine, emotsioonide varjamine, vigade vältimine on olulisemad kui rõõm, naudingud, puhkus, (The domain) involves schemas related to violations of the basic universal need for spontaneity and playfulness. ... These schemas often emerge from family atmosphere that is grim, demanding, and sometimes punitive. In such families perfomance, obligations, duties and rule-bound behavior often predominate over pleasure, relaxation or playfulness. Children are often expected to hide emotions, avoid mistakes, and strive for perfection. There is usually an undercurrent of pessimism and worry - that things could fall apart if one fails to be vigilant and careful at all times."
    },
    {
      "term": "häbi",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/h%C3%A4bi",
      "letter": "h",
      "language": "eesti",
      "synonyms": [],
      "definition": "hingepiin, kahetsus või piinlikkus, mille on tinginud sobimatu käitumine, ebaväärikas tegu, alandav olukord vms"
    },
    {
      "term": "hüljatus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/h%C3%BCljatus",
      "letter": "h",
      "language": "eesti",
      "synonyms": [],
      "definition": "maha jäetud, põlatud olek"
    },
    {
      "term": "identiteeditunne",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/identiteeditunne",
      "letter": "i",
      "language": "eesti",
      "synonyms": [
        "autonoomia",
        "kompetentsusetunne"
      ],
      "definition": "baasiline emotsionaalne vajadus autonoomia, kompetentsus- ja identiteeditunde järele, mis sisaldab võimalust sooritada iseseisvalt eakohaseid ülesandeid ning saada eakohast juhendamist ja tagasisidet, Being able to develop age appropriate tasks on your own, getting useful feedback and support to do this"
    },
    {
      "term": "imagery rescripting",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/imagery%20rescripting",
      "letter": "i",
      "language": "inglise",
      "synonyms": [],
      "definition": "terapeutiline tehnika, mis võimaldab korrigeerida käesolevate probleemidega seotud varasemate traumaatiliste mälestuste tähendusi, Imagery rescripting is a powerful experiential technique that uses the power of imagination and visualisation to identify and change meaningful and traumatic experiences in the past, resulting in transformation in the present., Imagery Rescripting (ImRs) is a therapeutic technique addressing specific memories of earlier experiences associated with present problems. By imagining that the course of events is changed in a more desired direction, powerful therapeutic effects have been found., Imagery rescripting can help clients to escape the original external scene in which they once felt trapped., Imagery rescripting creates a corrective emotional experience of change and strengthens the healthy adult mode., Rescripting does not change the memory itself, but rather the meaning for the client."
    },
    {
      "term": "impaired autonomy and achievement",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/impaired%20autonomy%20and%20achievement",
      "letter": "i",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on eeldused enese ning end ümbritseva kohta, mis segavad tajutud suutlikkust eralduda, iseseisvalt ellu jääda, funktsioneerida ning edukalt toime tulla, Expectations about oneself and the environment that interfere with one’s perceived ability to separate, survive, function independently, or perform successfully, Selle valdkonna skeemid kujunevad sageli siis, kui varases kasvukeskkonnas ollakse üleseotud või kui kasvukeskkond on lapse enesekindlust ja iseseisvust mittetoetav., This domain nvolves schemas related to violations of the basic universal needs for autonomy and competence, which lead to expectations about oneself and the environment that interfere with one’s perceived ability to separate, survive, function independently, and perform successfully. Schemas in this domain often emerge when early family environment is enmeshed, undermining of the child’s confidence, overprotective, or failing to reinforce the child for performing competently outside the family."
    },
    {
      "term": "impaired limits",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/impaired%20limits",
      "letter": "i",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on puudulik piiritunnetus, mis väljendub raskustes eneseregulatsioonis ja suhetes - vastutuse võtmises, teiste õiguste austamises, koostöö tegemises, lubaduste pidamises ning isiklike realistlike eesmärkide püstitamises ja saavutamises, deficiency in internal limits, responsibility to others, or long-term goal orientation. Leads to difficulty respecting the rights of others, coooperating with others, making commitments, or setting and meeting realistic personal goals, Selle valdkonna skeemid kujunevad sageli varases kasvukeskkonnas, mida iseloomustab liigne lubavus, teistest üleolemise tunne, pigem vähe distsipliini, suunamist ning vastutuse võtmiseks või teistega koostööks vajalike piiride kehtestamist, (This domain) involves schemas related to deficiencies in internal limits, responsibility towards others, or long-term goal-orientation. Schemas in this domain often lead to difficulties respecting the rights of others, cooperating with them, making commitments, or setting and meeting realistic personal goals. These schemas often emerge when early family environment is characterized by permissiveness, overindulgence, lack of direction, or a sense of superiority. Often, such families lacked appropriate confrontation, discipline, or limitsetting, and did not model behaviors such as taking responsibility, cooperating in a reciprocal manner, or setting goals. In some cases, the child may not have been expected to tolerate normal levels of discomfort, or may not have been given adequate supervision, direction, or guidance."
    },
    {
      "term": "impulsiivse lapse olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/impulsiivse%20lapse%20olek",
      "letter": "i",
      "language": "eesti",
      "synonyms": [],
      "definition": "lapse olek, milles püütakse täita oma soove ja tahtmisi isekal moel mõtlemata tagajärgedele. Selles olekus ei suudeta kontrollida oma tundeid ega impulsse ning tuntakse viha ja pettumust, kui soovid ei ole koheselt rahuldatud, The Impulsive Child mode is a side of the patient that behaves impulsively, and has difficulty tolerating frustration. The Impulsive Child \"wants what he wants when he wants it\". They experience their needs as urgent and find it intolerable to wait to have their needs met or to have them denied. When the Impulsive Child wants something, he immediately springs into action without stopping to think about the possible consequences (p. 57), The patient wants to satisfy his (non - core) desires in a selfish and uncontrolled manner. He cannot control his feelings and impulses and he becomes enraged and infuriated when his (non - core) desires or impulses are not met. He often behaves like a spoiled child (p. 34)"
    },
    {
      "term": "impulsive child mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/impulsive%20child%20mode",
      "letter": "i",
      "language": "inglise",
      "synonyms": [],
      "definition": "lapse olek, milles püütakse täita oma soove ja tahtmisi isekal moel mõtlemata tagajärgedele. Selles olekus ei suudeta kontrollida oma tundeid ega impulsse ning tuntakse viha ja pettumust, kui soovid ei ole koheselt rahuldatud, The Impulsive Child mode is a side of the patient that behaves impulsively, and has difficulty tolerating frustration. The Impulsive Child \"wants what he wants when he wants it\". They experience their needs as urgent and find it intolerable to wait to have their needs met or to have them denied. When the Impulsive Child wants something, he immediately springs into action without stopping to think about the possible consequences (p. 57), The patient wants to satisfy his (non - core) desires in a selfish and uncontrolled manner. He cannot control his feelings and impulses and he becomes enraged and infuriated when his (non - core) desires or impulses are not met. He often behaves like a spoiled child (p. 34)"
    },
    {
      "term": "incompetence",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/incompetence",
      "letter": "i",
      "language": "inglise",
      "synonyms": [
        "dependence"
      ],
      "definition": "eeldus, et ollakse võimetu pädevana toimima igapäevaelu kohustustes toetumata olulisel määral teiste abile (nt enese eest hoolt kandma, lahendama igapäevelu probleeme, vastu võtma otsuseid või lahendama uudseid ülesandeid), mis sageli väljendub abitusena, the belief that one is unable to handle one’s everyday responsibilities in a competent manner, without considerable help from others (e.g., take care of oneself, solve daily problems, exercise good judgment, tackle new tasks, make good decisions)., Often presents as helplessness, In extreme cases, individuals might feel unable to take care of themselves, solve daily problems, exercise good judgment, tackle new tasks, or make good decisions. In other cases, this sense of helplessness may be more circumscribed and be activated in particular situations or settings (e.g., in making important professional decisions or in choosing a partner., Äärmuslikematel juhtudel võidakse tunda end võimetuna enesehoolitsuseks, igapäevaelu probleemide lahendamisel, otsuseid nõudvates olukordades või uute olukordade käsitlemisel. Teistel juhtudel võib sarnane abituse kogemine olla enamal määral olukorra spetsiifiline ja aktiveeruda kindlates situatsioonides või juhtudel (näiteks olukorras, kus on vajalik langetada olulisi professionaalseid otsuseid või partneri valiku olukorras"
    },
    {
      "term": "instability",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/instability",
      "letter": "i",
      "language": "inglise",
      "synonyms": [
        "abandonment"
      ],
      "definition": "eeldus, et kõik elu jooksul loodud tähtsad suhted katkevad ning sellest tulenev pidev mure hülgamise ees, the feeling that important relationships which they have formed will never last and thus they are constantly worried about being abandoned by others, The perceived instability or unreliability of those available for support and connection. Involves the sense that significant others will not be able to continue providing emotional support, connection, strength, or practical protection because they are emotionally unstable and unpredictable (e.g., have angry outbursts), unreliable, or present only erratically; because they will die imminently; or because they will abandon the individual in favor of someone better., The patient expects that significant others will eventually abandon him. Others are unreliable and unpredictable in their support and connection. When the patient feels abandoned he switches between feelings of anxiety, grief and anger."
    },
    {
      "term": "insufficient self-control",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/insufficient%20self-control",
      "letter": "i",
      "language": "inglise",
      "synonyms": [
        "insufficient self-discipline"
      ],
      "definition": "eeldus, et ei suudeta eesmärgistatud tegevustes enesedistsiplineerimisega kaasnevat ebamugavustunnet ära taluda, mis väljendub impulsi kontrolli ja emotsiooni regulatsiooni raskustes, katsetes vältida ebamugavuse kogemist (valu, konflikte, vastutust) või liigset pingutust eneseteostuse, pühendumise või väärikuse arvelt, a pervasive difficulty or refusal to exercise sufficient self-control and frustration tolerance to achieve one’s personal goals, or to restrain the excessive expression of one’s emotions and impulses, In its milder form, patients present with an exaggerated emphasis on avoiding discomfort: avoiding pain, conflict, confrontation, responsibility, or overexertion – at the expense of personal fulfillment, commitment, or integrity., The patient has no tolerance of frustration and is unable to control his feelings and impulses. He cannot bear dissatisfaction or discomfort (pain, conflicts, or overexertion)."
    },
    {
      "term": "insufficient self-discipline",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/insufficient%20self-discipline",
      "letter": "i",
      "language": "inglise",
      "synonyms": [
        "insufficient self-control"
      ],
      "definition": "eeldus, et ei suudeta eesmärgistatud tegevustes enesedistsiplineerimisega kaasnevat ebamugavustunnet ära taluda, mis väljendub impulsi kontrolli ja emotsiooni regulatsiooni raskustes, katsetes vältida ebamugavuse kogemist (valu, konflikte, vastutust) või liigset pingutust eneseteostuse, pühendumise või väärikuse arvelt, a pervasive difficulty or refusal to exercise sufficient self-control and frustration tolerance to achieve one’s personal goals, or to restrain the excessive expression of one’s emotions and impulses, In its milder form, patients present with an exaggerated emphasis on avoiding discomfort: avoiding pain, conflict, confrontation, responsibility, or overexertion – at the expense of personal fulfillment, commitment, or integrity., The patient has no tolerance of frustration and is unable to control his feelings and impulses. He cannot bear dissatisfaction or discomfort (pain, conflicts, or overexertion)."
    },
    {
      "term": "inversion",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/inversion",
      "letter": "i",
      "language": "inglise",
      "synonyms": [],
      "definition": "the way of the schema handling where the person deals with EMS activation by believing the opposite of the EMS is true, reageerimise viis, mille puhul inimene toimib vastupidiselt aktiveerunud skeemile, uskudes skeemi vastandlikku tähendust"
    },
    {
      "term": "jäigad standardid",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/j%C3%A4igad%20standardid",
      "letter": "j",
      "language": "eesti",
      "synonyms": [
        "ülikriitilisus"
      ],
      "definition": "eeldus, et peab vastama väga kõrgetele internaliseerunud sisemistele käitumise ja sooritusega seotud standarditele vältimaks (võimaliku) kriitika osaliseks saamist, the underlying belief that one must strive to meet very high internalized standards of behavior and performance, usually to avoid criticism, Typically results in feelings of pressure or difficulty slowing down and in hypercriticalness toward oneself and others. Must involve significant impairment in pleasure, relaxation, health, self-esteem, sense of accomplishment, or satisfying relationships. Unrelenting standards typically present as (a) perfectionism, inordinate attention to detail, or an underestimate of how good one’s own performance is relative to the norm; (b) rigid rules and “shoulds” in many areas of life, including unrealistically high moral, ethical, cultural, or religious precepts; or (c) preoccupation with time and efficiency, the need to accomplish more (p. 17), Tüüpiliselt kaasnevad pingetunne, raskused puhata ja rõõmu tunda, ülim kriitilisus nii iseenda kui teiste suhtes. Kahjustatud on üldine tervis, enesehinnang ja võimelisus eneseteostuseks ning rahuldust pakkuvateks suheteks. Jäigad standardid väljenduvad: (a) täiuslikkuse püüdlusena, ülemäärases tähelepanus detailide suhtes või enese soorituse alahindamises normiga võrreldes; (b) rigiidsetes reeglites ja \"nii peab/on õige\" sõnumites elu erinevate valdkondade kohta, seejuures ebarealistlikult kõrgetes moraalsetes nõudmistes, eetilistes, kultuurilistes või religioossetes ettekirjutustes; või selles, et (c) ollakse üle hõivatud aja kasu ja tõhususe küsimustega vajadusest saavutada enamat."
    },
    {
      "term": "kahjustunud autonoomia ja toimetulek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/kahjustunud%20autonoomia%20ja%20toimetulek",
      "letter": "k",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on eeldused enese ning end ümbritseva kohta, mis segavad tajutud suutlikkust eralduda, iseseisvalt ellu jääda, funktsioneerida ning edukalt toime tulla, Expectations about oneself and the environment that interfere with one’s perceived ability to separate, survive, function independently, or perform successfully, Selle valdkonna skeemid kujunevad sageli siis, kui varases kasvukeskkonnas ollakse üleseotud või kui kasvukeskkond on lapse enesekindlust ja iseseisvust mittetoetav., This domain nvolves schemas related to violations of the basic universal needs for autonomy and competence, which lead to expectations about oneself and the environment that interfere with one’s perceived ability to separate, survive, function independently, and perform successfully. Schemas in this domain often emerge when early family environment is enmeshed, undermining of the child’s confidence, overprotective, or failing to reinforce the child for performing competently outside the family."
    },
    {
      "term": "kahjustunud piirid",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/kahjustunud%20piirid",
      "letter": "k",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on puudulik piiritunnetus, mis väljendub raskustes eneseregulatsioonis ja suhetes - vastutuse võtmises, teiste õiguste austamises, koostöö tegemises, lubaduste pidamises ning isiklike realistlike eesmärkide püstitamises ja saavutamises, deficiency in internal limits, responsibility to others, or long-term goal orientation. Leads to difficulty respecting the rights of others, coooperating with others, making commitments, or setting and meeting realistic personal goals, Selle valdkonna skeemid kujunevad sageli varases kasvukeskkonnas, mida iseloomustab liigne lubavus, teistest üleolemise tunne, pigem vähe distsipliini, suunamist ning vastutuse võtmiseks või teistega koostööks vajalike piiride kehtestamist, (This domain) involves schemas related to deficiencies in internal limits, responsibility towards others, or long-term goal-orientation. Schemas in this domain often lead to difficulties respecting the rights of others, cooperating with them, making commitments, or setting and meeting realistic personal goals. These schemas often emerge when early family environment is characterized by permissiveness, overindulgence, lack of direction, or a sense of superiority. Often, such families lacked appropriate confrontation, discipline, or limitsetting, and did not model behaviors such as taking responsibility, cooperating in a reciprocal manner, or setting goals. In some cases, the child may not have been expected to tolerate normal levels of discomfort, or may not have been given adequate supervision, direction, or guidance."
    },
    {
      "term": "karistava kriitiku olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/karistava%20kriitiku%20olek",
      "letter": "k",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks sisemise kriitiku olekutest, milles ollakse enda vastu agressiivne, mitteaktsepteeriv, mitteandestav ning kriitiline vigade tegemise ja piirav/keelav vajaduste väljendamise suhtes, The function of this mode is to punish the patient for doing something “wrong,” such as expressing needs or feelings. The mode is an internalization of one or both parents’ rage, hatred, loathing, abuse, or subjugation of the patient as a child., This is the internalizing voice of the parent or other upbringer, criticizing and punishing patients, who become angry with themselves and feel that they deserve punishment for feeling and/or displaying normal needs which were punished when expressed in childhood. The tone of this mode is harsh, critical and unforgiving. Signs and symptoms include self-loathing, self-crticism, self-denial, suicidal fantasies, and self-destructive behavior."
    },
    {
      "term": "kindel kiindumussuhe",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/kindel%20kiindumussuhe",
      "letter": "k",
      "language": "eesti",
      "synonyms": [],
      "definition": "võime usaldada teisi ja kindlus (lähi)suhete püsivuse suhtes, confidence that (close) relationships will maintain and ability to trust others"
    },
    {
      "term": "kompetentsusetunne",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/kompetentsusetunne",
      "letter": "k",
      "language": "eesti",
      "synonyms": [
        "autonoomia",
        "identiteeditunne"
      ],
      "definition": "baasiline emotsionaalne vajadus autonoomia, kompetentsus- ja identiteeditunde järele, mis sisaldab võimalust sooritada iseseisvalt eakohaseid ülesandeid ning saada eakohast juhendamist ja tagasisidet, Being able to develop age appropriate tasks on your own, getting useful feedback and support to do this"
    },
    {
      "term": "korrigeeriv emotsionaalne kogemus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/korrigeeriv%20emotsionaalne%20kogemus",
      "letter": "k",
      "language": "eesti",
      "synonyms": [],
      "definition": "terapeutilise sekkumise viis, mille käigus rakendatakse kogemuslikke ja terapeutilise suhte tehnikaid, korrigeerimaks varaste emotsionaalsete suhtekogemuste baasil välja kujunenud mittekohastumuslikke skeeme, Utilizing the therapy relationship to establish a caring, trusting relationship that allows the patient to undergo the experience of having their needs met in a sufficient, healthy and adaptive way., Terapeudi ja patsiendi suhetes kultiveeritud hooliv ja usalduslik suhe, mis võimaldab patsiendil kogeda oma emotsionaalsete vajaduste rahuldamise võimalikkust küllaldasel, tervel ja kohanemist toetaval viisil."
    },
    {
      "term": "kujutluses ümberkirjutamine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/kujutluses%20%C3%BCmberkirjutamine",
      "letter": "k",
      "language": "eesti",
      "synonyms": [],
      "definition": "terapeutiline tehnika, mis võimaldab korrigeerida käesolevate probleemidega seotud varasemate traumaatiliste mälestuste tähendusi, Imagery rescripting is a powerful experiential technique that uses the power of imagination and visualisation to identify and change meaningful and traumatic experiences in the past, resulting in transformation in the present., Imagery Rescripting (ImRs) is a therapeutic technique addressing specific memories of earlier experiences associated with present problems. By imagining that the course of events is changed in a more desired direction, powerful therapeutic effects have been found., Imagery rescripting can help clients to escape the original external scene in which they once felt trapped., Imagery rescripting creates a corrective emotional experience of change and strengthens the healthy adult mode., Rescripting does not change the memory itself, but rather the meaning for the client."
    },
    {
      "term": "kuuleka alistuja olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/kuuleka%20alistuja%20olek",
      "letter": "k",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mida iseloomustab kuulekus ja järeleandlikkus teiste ootustele ja nõudmistele enamasti isiklike vajaduste arvelt, The Compliant Surrenderer submits to the schema, becoming once again the passive, helpless child who must give in to others., Acts in a passive, subservient,submissive, reassurance seeking or self-deprecating way towards others out of fear of conflict or rejection. Passively accepts abuse, or simply does not take steps to get healthy needs met. selects partners or engages in other behavior that directly maintains the self-defeating schema-driven patterns."
    },
    {
      "term": "lapse olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/lapse%20olek",
      "letter": "l",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks kategooria skeemi olekutest, mis on sünnipärased ja universaalsed vastused emotsionaalsete vajaduste rahuldatusele ning neid olekuid iseloomustavad tugevad tunded ning lapsele omased reaktsioonid, primary or innate intense feelings that involve the innate reactions a child has, Primary or innate child modes (Vulnerable Child, Angry Child, Impulsive Child) are said to develop when basic emotional needs in childhood (such as safety, nurturance, or autonomy) are not adequately met. These “child modes” are defined by intense feelings such as fear, helplessness, or rage, and involve the innate reactions a child has."
    },
    {
      "term": "limited reparenting",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/limited%20reparenting",
      "letter": "l",
      "language": "inglise",
      "synonyms": [],
      "definition": "terapeutilise suhte tehnika, milles terapeudi olemise viis ja käitumine on suunatud kliendi emotsionaalsete baasvajaduste korrigeerivale täitmisele, The therapy relationship as a “corrective emotional experience”, which involves the establishment of a secure attachment through the therapist, within the bounds of a professional relationship, doing what she can to meet unmet needs., Limited reparenting involves supplying, within the appropriate bounds of the therapeutic relationship, what patients needed but did not receive from their parents in childhood., Within the appropriate limits of therapy, the therapist acts toward the patient in ways that serve as an antidote to early deficits in the patient’s parenting. Through reparenting in imagery work, the therapist helps patients go back into that child mode and to learn to get from the therapist, and later from themselves, some of what they missed., Limited reparenting is both a therapist style and an active ingredient or component of mode-change work. Limited reparenting is defined as: acting as a good parent would in meeting child mode needs within the bounds of an appropriate therapy relationship. This means providing protection, validation, and comfort for the Vulnerable Child Mode; the opportunity to vent and be heard for the Angry Child; and empathic confrontation and limit setting for the Impulsive Child Mode. Limited reparenting is one of the core components of ST and a hypothesized active ingredient. Limited reparenting is often referred to as the “heart of ST.”"
    },
    {
      "term": "läbikukkumine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/l%C3%A4bikukkumine",
      "letter": "l",
      "language": "eesti",
      "synonyms": [],
      "definition": "ebaõnnestumine millegi saavutamisel, mingi eesmärgi täitmisel, eksamil halva tulemuse saamine (mille tõttu eksam arvestatakse mittesooritatuks)"
    },
    {
      "term": "maladaptive coping mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/maladaptive%20coping%20mode",
      "letter": "m",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks kategooria skeemi olekutest, mille eesmärk on psühholoogiliselt kaitsta aktiveerunud skeemiga kaasnevate ebameeldivate emotsioonide eest, The Maladaptive Coping modes represent the child’s attempts to adapt to living with unmet emotional needs in a harmful environment. These coping modes were adaptive when the patient was a young child, but they are often maladaptive in the wider adult world (p. 275), Schema therapy distinguishes three types of maladaptive coping modes: The detached protector, the Compliant surrender and the Overcompensator modes. These modes correspond to the maladaptive coping styles of schema avoidance, surrender and overcompensation, respectively. In contrast to the coping styles, however, which focus solely on coping behaviors, the coping modes are emotional states that involve emotions, cognitions,and behavioral responses that are active at a given moment, when early maladaptive schemas have been triggered (p. 59), Maladaptive Coping Modes, a third category of mode, are defined by an overuse of unhealthy coping styles (fight –overcompensation; flight – avoidance; or freeze – surrender). All have the goal of protecting the person from experiencing pain, anxiety, or fear (p. 7)"
    },
    {
      "term": "mesinädalate kujutlus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/mesin%C3%A4dalate%20kujutlus",
      "letter": "m",
      "language": "eesti",
      "synonyms": [],
      "definition": "kogemuslik kujutlustehnika paariskeemiteraapias, mille eesmärk on aktiveerida partnerite positiivseid mälestusi teineteisest ja taastada nende emotsionaalne ühendus, an imagery exercise with the purpose to induce the couple's emotional connection based on shared good memories"
    },
    {
      "term": "mistrust",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/mistrust",
      "letter": "m",
      "language": "inglise",
      "synonyms": [
        "abuse"
      ],
      "definition": "eeldus, et saadakse teiste poolt kuritarvitatud, alandatud või muul moel halvasti koheldud ning sellest tulenev pidev kahtlus, et teised teevad neile meelega haiget, people with this schema expect to be abused,humiliated,or in other ways badly treated by others, they are constantly suspicious, because they are afraid of being deliberately harmed., The expectation that others will hurt, abuse, humiliate, cheat, lie, manipulate, or take advantage. Usually involves the perception that the harm is intentional or the result of unjustified and extreme negligence. May include the sense that one always ends up being cheated relative to others or “getting the short end of the stick.”"
    },
    {
      "term": "mode clash",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/mode%20clash",
      "letter": "m",
      "language": "inglise",
      "synonyms": [],
      "definition": "inimestevahelises suhtluses esinev olekute tsükkel ehk negatiivne suhtetsükkel, milles vastastikku käivitunud toimetulekuolekud viivad suhtluse eskaleerumise ja konfliktini"
    },
    {
      "term": "mode cycle",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/mode%20cycle",
      "letter": "m",
      "language": "inglise",
      "synonyms": [],
      "definition": "kahe inimese olekute interaktsiooni tsirkulaarsuse tulemus ehk suhtetsükkel, mis võib olla nii fuktsionaalne kui düsfunktsionaalne"
    },
    {
      "term": "mode cycle clash-card",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/mode%20cycle%20clash-card",
      "letter": "m",
      "language": "inglise",
      "synonyms": [],
      "definition": "a methodical tool of schema couples therapy that helps to conceptualize couple dynamics which describes triggers, different schema modes and needs of both partners, their mutual influence and consequences for the relationship, töövahend paari dünaamika kontseptualiseerimiseks paariskeemiteraapias, mis aitab kirjeldada mõlema partneri päästikuid, erinevaid skeemi olekuid ja vajadusi ning nende vastastikust mõju ja tagajärgi suhtele"
    },
    {
      "term": "mode dialogue",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/mode%20dialogue",
      "letter": "m",
      "language": "inglise",
      "synonyms": [],
      "definition": "kogemuslik tehnika, milles kehastutakse erinevatel viisidel olekuteks nende teadvustamise, nendevahelise suhtluse käivitamise ja muutmise eesmärgil, In mode work, therapists ask patients to play different sides of themselves (i.e., different modes), switching chairs as they assume the role of different modes"
    },
    {
      "term": "need for fairness",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/need%20for%20fairness",
      "letter": "n",
      "language": "inglise",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus olla koheldud võrdselt, moraalselt, samaväärselt ja/või õigustatult, the need for sameness, where everything is kept equal by being the same but can also mean \"deservedness\" meaning a person gets what they deserve"
    },
    {
      "term": "need for self-coherence",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/need%20for%20self-coherence",
      "letter": "n",
      "language": "inglise",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus kooskõlalise identiteedi ning mõtestatud ja tähendusliku maailmatunnetuse järele, desire to feel psychologically intact and rooted. It is about the need for experiencing the self as integrated and the world as meaningful, in relation to the person"
    },
    {
      "term": "negatiivsus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/negatiivsus",
      "letter": "n",
      "language": "eesti",
      "synonyms": [],
      "definition": "halvale, halbadele külgedele keskendumine või selline suhtumine"
    },
    {
      "term": "negativity",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/negativity",
      "letter": "n",
      "language": "inglise",
      "synonyms": [],
      "definition": "halvale, halbadele külgedele keskendumine või selline suhtumine"
    },
    {
      "term": "nõudliku kriitiku olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/n%C3%B5udliku%20kriitiku%20olek",
      "letter": "n",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks sisemise kriitiku olekutest, milles esitatakse enda suhtes ebarealistlikult kõrgeid nõudmisi ja oodatakse nendele vastamist järeleandmisi tegemata. Tuntakse, et peab olema perfektne ja ei tohi olla spontaanne ega teha vigu, The Demanding Parent mode is the side of the patient that places almost impossible demands on him.This often takes the form of demands for achievement or success, but can also involve other types of demands, for example, a demand that a child sacrifice his own autonomy to take care of the parent. When in Demanding Parent mode, the patient experiences unrelenting pressure to push himself to succeed. Patients with this mode often believe that they need this side of themselves to push them to achieve, and fail to recognize the way in which this side can be crippling (p. 64), Continually pushes and pressures the child to meet excessively high standards. Feels that the only acceptable way to be is to be perfect and an overachiever, to keep everything in order, to strive for high status, to be humble, to put other 's needs before one's own, or to be efficient or avoid wasting time. The person feels that it is wrong to express feelings or to be spontaneous (p. 44)"
    },
    {
      "term": "olekute dialoog",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/olekute%20dialoog",
      "letter": "o",
      "language": "eesti",
      "synonyms": [],
      "definition": "kogemuslik tehnika, milles kehastutakse erinevatel viisidel olekuteks nende teadvustamise, nendevahelise suhtluse käivitamise ja muutmise eesmärgil, In mode work, therapists ask patients to play different sides of themselves (i.e., different modes), switching chairs as they assume the role of different modes"
    },
    {
      "term": "olekute kokkupõrge",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/olekute%20kokkup%C3%B5rge",
      "letter": "o",
      "language": "eesti",
      "synonyms": [],
      "definition": "inimestevahelises suhtluses esinev olekute tsükkel ehk negatiivne suhtetsükkel, milles vastastikku käivitunud toimetulekuolekud viivad suhtluse eskaleerumise ja konfliktini"
    },
    {
      "term": "olekute kokkupõrke kaart",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/olekute%20kokkup%C3%B5rke%20kaart",
      "letter": "o",
      "language": "eesti",
      "synonyms": [],
      "definition": "a methodical tool of schema couples therapy that helps to conceptualize couple dynamics which describes triggers, different schema modes and needs of both partners, their mutual influence and consequences for the relationship, töövahend paari dünaamika kontseptualiseerimiseks paariskeemiteraapias, mis aitab kirjeldada mõlema partneri päästikuid, erinevaid skeemi olekuid ja vajadusi ning nende vastastikust mõju ja tagajärgi suhtele"
    },
    {
      "term": "olekute tsükkel",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/olekute%20ts%C3%BCkkel",
      "letter": "o",
      "language": "eesti",
      "synonyms": [],
      "definition": "kahe inimese olekute interaktsiooni tsirkulaarsuse tulemus ehk suhtetsükkel, mis võib olla nii fuktsionaalne kui düsfunktsionaalne"
    },
    {
      "term": "optimism",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/optimism",
      "letter": "o",
      "language": "inglise",
      "synonyms": [],
      "definition": "julge ja elurõõmus suhtumine elus ettetulevasse, headele külgedele keskendumine, lootusrikkus tuleviku suhtes"
    },
    {
      "term": "other-directedness",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/other-directedness",
      "letter": "o",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on äärmuslik teiste soovidele, tunnetele ja reaktsioonidele keskendumine iseenda vajaduste arvelt eesmärgiga saada armastust või heakskiitu, säilitada tajutud seotust või vältida kardetavat kättemaksu, An excessive focus on the desires, feelings, and responses of others, at the expense of one’s own needs in order to gain love and approval, maintain one’s sense of connection, or avoid retaliation., Selle valdkonna skeemid kujunevad sageli varases kasvukeskkonnas, mida iseloomustab tingimuslik aktsepteerimine: laps peab alla suruma enda jaoks olulisi aspekte selleks, et saada armastust, tähelepanu, heakskiitu. Sageli hõlmab see oma viha ja loomulike reaktsioonide allasurumist või vähest teadlikkust neist., (This domain) involves schemas related to deficits in the fulfillment of the basic universal need for self-directness. Such deficits lead to an excessive focus on the desires, feelings, and responses of others, at the expense of one’s own needs. This focus is driven by the need to gain love and approval, maintain a sense of connection or belonging, or avoid retaliation. These schemas usually involve a suppression or lack of awareness regarding one’s own emotions, needs, or wishes, and lead to difficulties in assertion or self-determination. They often emerge when children are brought up in an atmosphere of conditional positive regard or conditional acceptance: the child needed to suppress important aspects of the self in order to gain love, attention, or approval. In many cases, the parents’ emotional needs and desires – or social acceptance and status – were valued more than the unique needs and feelings of each child., Usually involves suppression and lack of awareness regarding one’s own anger and natural inclinations"
    },
    {
      "term": "overanalysing overcontroller mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/overanalysing%20overcontroller%20mode",
      "letter": "o",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest ülekompenseerivatest toimetulekuolekutest, mida iseloomustab ülekaalukas minevikule ja/või tulevikule keskendunud verbaalne infotöötlus selle asemel, et pöörata tähelepanu vahetu kogemuse emotsionaalsetele ja tähenduslikele aspektidelekeskendub asjade \"õigeks muutmisele\" ja vigade vältimisele, et minimeerida kriitika, pettumuse ja ebaõnnestumise võimalust, predominance of verbal-linguistic processing of past- and/or future-oriented material at the expense of attending to the contextual and emotional qualities of present-moment experience"
    },
    {
      "term": "overcompensation",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/overcompensation",
      "letter": "o",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemiga toime tulemise viis, mis sisaldab katseid toimida vastupidiselt aktiveerunud skeemile, a broad tendency to act in an opposite way to the triggered schema or schemas, which can manifest itself in a variety of specific overcompensating coping responses, Behaving in a very dominant and self-confident way, as if the opposite of the schema were true."
    },
    {
      "term": "overcompensator mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/overcompensator%20mode",
      "letter": "o",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mis sisaldab aktiveerunud skeemile vastupidiseid käitumisi, The Overcompensator fights back either by mistreating others or by behaving in extreme ways in an attempt to disprove the schema in a manner that ultimately proves dysfunctional., The Overcompensator Mode refers to a number of specific emotional states, which all involve overcompensatory forms of coping. Overcompensator Modes involves doing the opposite of schemas, in an attempt to escape from the painful emotions associated with them."
    },
    {
      "term": "overcontroller mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/overcontroller%20mode",
      "letter": "o",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks ülekompenseerija olekutest, milles olles kaitstakse end reaalse või tajutud ohu ja haavatavuse eest kõrgendatud tähelepanelikkuse, rumineerimise, enda ja teiste üle kontrolli saavutamise kaudu, The Overcontroller mode is an attempt to protect oneself from a perceived threat by focusing attention, ruminating, and exercising control over others"
    },
    {
      "term": "paariskeemiteraapia",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/paariskeemiteraapia",
      "letter": "p",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemiteraapia suund, milles skeemiteraapia teooria ja meetodid on kohandatud tööks paaridega"
    },
    {
      "term": "perfectionistic overcontroller mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/perfectionistic%20overcontroller%20mode",
      "letter": "p",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest ülekompenseerivatest toimetulekuolekutest, mida iseloomustab täiusliku soorituse taotlus ja liigne kontroll, et vältida vigade tegemist selleks, et vähendada võimaliku kriitika, pettumuse, läbikukkumise kogemist, in this mode the one uses excessive control and perfectionism as strategy to avoid making mistakes and/or feeling guilty for things that go wrong"
    },
    {
      "term": "perfektsionistliku ülekontrollija olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/perfektsionistliku%20%C3%BClekontrollija%20olek",
      "letter": "p",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest ülekompenseerivatest toimetulekuolekutest, mida iseloomustab täiusliku soorituse taotlus ja liigne kontroll, et vältida vigade tegemist selleks, et vähendada võimaliku kriitika, pettumuse, läbikukkumise kogemist, in this mode the one uses excessive control and perfectionism as strategy to avoid making mistakes and/or feeling guilty for things that go wrong"
    },
    {
      "term": "pessimism",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/pessimism",
      "letter": "p",
      "language": "eesti",
      "synonyms": [],
      "definition": "negatiivne suhtumine elus ettetulevasse, halbadele külgedele keskendumine, ettevaatlikkus tuleviku suhtes"
    },
    {
      "term": "piiritletud vanemlikkus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/piiritletud%20vanemlikkus",
      "letter": "p",
      "language": "eesti",
      "synonyms": [],
      "definition": "terapeutilise suhte tehnika, milles terapeudi olemise viis ja käitumine on suunatud kliendi emotsionaalsete baasvajaduste korrigeerivale täitmisele, The therapy relationship as a “corrective emotional experience”, which involves the establishment of a secure attachment through the therapist, within the bounds of a professional relationship, doing what she can to meet unmet needs., Limited reparenting involves supplying, within the appropriate bounds of the therapeutic relationship, what patients needed but did not receive from their parents in childhood., Within the appropriate limits of therapy, the therapist acts toward the patient in ways that serve as an antidote to early deficits in the patient’s parenting. Through reparenting in imagery work, the therapist helps patients go back into that child mode and to learn to get from the therapist, and later from themselves, some of what they missed., Limited reparenting is both a therapist style and an active ingredient or component of mode-change work. Limited reparenting is defined as: acting as a good parent would in meeting child mode needs within the bounds of an appropriate therapy relationship. This means providing protection, validation, and comfort for the Vulnerable Child Mode; the opportunity to vent and be heard for the Angry Child; and empathic confrontation and limit setting for the Impulsive Child Mode. Limited reparenting is one of the core components of ST and a hypothesized active ingredient. Limited reparenting is often referred to as the “heart of ST.”"
    },
    {
      "term": "positiivne skeem",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/positiivne%20skeem",
      "letter": "p",
      "language": "eesti",
      "synonyms": [],
      "definition": "lai, kõikehõlmav enda ja oma suhete kohta käiv mälestustest, emotsioonidest, kognitsioonidest ja kehalistest aistingutest koosnev muster, mis kujuneb varases arengus lapse baasiliste emotsionaalsete vajaduste rahuldamisel (esmaselt) oluliste täiskasvanute poolt"
    },
    {
      "term": "positive schema",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/positive%20schema",
      "letter": "p",
      "language": "inglise",
      "synonyms": [],
      "definition": "lai, kõikehõlmav enda ja oma suhete kohta käiv mälestustest, emotsioonidest, kognitsioonidest ja kehalistest aistingutest koosnev muster, mis kujuneb varases arengus lapse baasiliste emotsionaalsete vajaduste rahuldamisel (esmaselt) oluliste täiskasvanute poolt"
    },
    {
      "term": "punitive parent mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/punitive%20parent%20mode",
      "letter": "p",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks sisemise kriitiku olekutest, milles ollakse enda vastu agressiivne, mitteaktsepteeriv, mitteandestav ning kriitiline vigade tegemise ja piirav/keelav vajaduste väljendamise suhtes, The function of this mode is to punish the patient for doing something “wrong,” such as expressing needs or feelings. The mode is an internalization of one or both parents’ rage, hatred, loathing, abuse, or subjugation of the patient as a child., This is the internalizing voice of the parent or other upbringer, criticizing and punishing patients, who become angry with themselves and feel that they deserve punishment for feeling and/or displaying normal needs which were punished when expressed in childhood. The tone of this mode is harsh, critical and unforgiving. Signs and symptoms include self-loathing, self-crticism, self-denial, suicidal fantasies, and self-destructive behavior."
    },
    {
      "term": "punitiveness",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/punitiveness",
      "letter": "p",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et inimesi, kaasa arvatud iseennast, tuleb eksimuste ja vigade eest karmilt karistada, sisaldades kalduvust olla vihane, sallimatu, kannatamatu ja karistav kõigi nende suhtes, kes ootustele või standarditele ei vasta, the belief that people should be harshly punished for making mistakes. Involves the tendency to be angry, intolerant, punitive, and impatient with those people (including oneself) who do not meet one’s expectations or standards, Usually includes difficulty forgiving mistakes in oneself or others because of a reluctance to consider extenuating circumstances, allow for human imperfection, or empathize with feelings., Sageli kogetakse raskust endale või teistele eksimuste andestamisel, tuntakse vastumeelsust pehmendavate asjaolude arvesse võtmisel, inimliku ebatäiuslikkuse lubamisel või empaatilisel tunnetele kaasa elamisel."
    },
    {
      "term": "punitiveness towards others",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/punitiveness%20towards%20others",
      "letter": "p",
      "language": "inglise",
      "synonyms": [],
      "definition": "varane mittekohastumuslik skeem, mida iseloomustavad hõivatus õigluse põhimõttest, vaenulikkus teiste vigade, kannatuse ja ebatäiuslikkuse suhtes ning uskumus, et teisi tuleb karistada või vastutusele võtta nende eksimuste eest eirates leevendavaid asjaolusid, hypercriticalness towards others’ mistakes, suffering, or imperfections. Involves a belief that others should be punished or held accountable for their indiscretions, a tendency to ignore extenuating circumstances and naturally human error, and a preoccupation with concepts of justice"
    },
    {
      "term": "punitiveness towards self",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/punitiveness%20towards%20self",
      "letter": "p",
      "language": "inglise",
      "synonyms": [],
      "definition": "varane mittekohastumuslik skeem, mida iseloomustavad vaenulikkus oma vigade, kannatuse ja ebatäiuslikkuse suhtes, enesesüüdistus ning enesele esitatavad kõrged ja jäigad ootused, mille suhtes eksimine on andestamatu, self-directed hypercriticalness towards one’s own mistakes, suffering, or imperfections. Involves a belief that one should be punished or held accountable in some way for failing to meet expectations, a tendency to ignore extenuating circumstances, and an excessive sense of responsibility leading to self-blame, self-directed anger, and difficulty forgiving oneself."
    },
    {
      "term": "puudulik enesedistsipliin",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/puudulik%20enesedistsipliin",
      "letter": "p",
      "language": "eesti",
      "synonyms": [
        "puudulik enesekontroll"
      ],
      "definition": "eeldus, et ei suudeta eesmärgistatud tegevustes enesedistsiplineerimisega kaasnevat ebamugavustunnet ära taluda, mis väljendub impulsi kontrolli ja emotsiooni regulatsiooni raskustes, katsetes vältida ebamugavuse kogemist (valu, konflikte, vastutust) või liigset pingutust eneseteostuse, pühendumise või väärikuse arvelt, a pervasive difficulty or refusal to exercise sufficient self-control and frustration tolerance to achieve one’s personal goals, or to restrain the excessive expression of one’s emotions and impulses, In its milder form, patients present with an exaggerated emphasis on avoiding discomfort: avoiding pain, conflict, confrontation, responsibility, or overexertion – at the expense of personal fulfillment, commitment, or integrity., The patient has no tolerance of frustration and is unable to control his feelings and impulses. He cannot bear dissatisfaction or discomfort (pain, conflicts, or overexertion)."
    },
    {
      "term": "puudulik enesekontroll",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/puudulik%20enesekontroll",
      "letter": "p",
      "language": "eesti",
      "synonyms": [
        "puudulik enesedistsipliin"
      ],
      "definition": "eeldus, et ei suudeta eesmärgistatud tegevustes enesedistsiplineerimisega kaasnevat ebamugavustunnet ära taluda, mis väljendub impulsi kontrolli ja emotsiooni regulatsiooni raskustes, katsetes vältida ebamugavuse kogemist (valu, konflikte, vastutust) või liigset pingutust eneseteostuse, pühendumise või väärikuse arvelt, a pervasive difficulty or refusal to exercise sufficient self-control and frustration tolerance to achieve one’s personal goals, or to restrain the excessive expression of one’s emotions and impulses, In its milder form, patients present with an exaggerated emphasis on avoiding discomfort: avoiding pain, conflict, confrontation, responsibility, or overexertion – at the expense of personal fulfillment, commitment, or integrity., The patient has no tolerance of frustration and is unable to control his feelings and impulses. He cannot bear dissatisfaction or discomfort (pain, conflicts, or overexertion)."
    },
    {
      "term": "puudulikkus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/puudulikkus",
      "letter": "p",
      "language": "eesti",
      "synonyms": [],
      "definition": "(oskuste, teadmiste) vähesus, ebapiisavus"
    },
    {
      "term": "raevunud lapse olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/raevunud%20lapse%20olek",
      "letter": "r",
      "language": "eesti",
      "synonyms": [],
      "definition": "lapse olek, milles tuntakse raevu, mis päädib kontrollimatu teisi või asju kahjustava agressiivse käitumisega, Experiences intense feelings of rage that result in uncontrolled aggression, such as hurting people or damaging objects. The displayed aggression is out of control and aims to destroy or exterminate the aggressor, sometimes literally. The patient may display the affect of an enraged or uncontrollable child, acting out or screaming at an (alleged) perpetrator., The patient feels enraged for the same reason as the Angry Child, but loses control. This is expressed in offensive and injurious actions toward people and objects, in the same way as a small child hurts his parents."
    },
    {
      "term": "realistic expectations",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/realistic%20expectations",
      "letter": "r",
      "language": "inglise",
      "synonyms": [],
      "definition": "rahulolu enda sooritustega vajaduseta olla parim, being content with one's perfomances without having to be the best"
    },
    {
      "term": "realistic limits and self-control",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/realistic%20limits%20and%20self-control",
      "letter": "r",
      "language": "inglise",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus turvaliste ja eakohaste piiride järele"
    },
    {
      "term": "realistlikud ootused",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/realistlikud%20ootused",
      "letter": "r",
      "language": "eesti",
      "synonyms": [],
      "definition": "rahulolu enda sooritustega vajaduseta olla parim, being content with one's perfomances without having to be the best"
    },
    {
      "term": "realistlikud piirid ja enesekontroll",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/realistlikud%20piirid%20ja%20enesekontroll",
      "letter": "r",
      "language": "eesti",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus turvaliste ja eakohaste piiride järele"
    },
    {
      "term": "resignation",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/resignation",
      "letter": "r",
      "language": "inglise",
      "synonyms": [],
      "definition": "reageerimise viis, mille puhul inimene toimib aktiveerunud skeemi kohaselt, uskudes täielikult selle tähendust, the way of the schema handling where the person gives in to the early maladaptive schema activation and fully believes to the early maladaptive schema, To understand how schemas work, three schema maintenance processes must be defined. These processes are schema support, schema avoidance, and schema compensation. Through these three processes, schemas exert their influence on our behaviour and work to ensure their survival."
    },
    {
      "term": "ründaja olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/r%C3%BCndaja%20olek",
      "letter": "r",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, milles olles kasutab inimene ähvardusi või agressiivsust, et kinnitada oma üleolekut, saada midagi mida ta tahab, või kätte maksta tajutud ohu eest ning selles olekus tunneb inimene end tugeva ja võimsana, mis kompenseerib nõrkuse ja abituse tunnet, a state in which patients use threats or aggression to assert their dominance, get something they want, or retaliate against a perceived threat or rival and when in this state, patients feel strong and powerful, compensating for underlying feelings of weakness and helplessness"
    },
    {
      "term": "sallimatu karistavus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/sallimatu%20karistavus",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "eeldus, et inimesi, kaasa arvatud iseennast, tuleb eksimuste ja vigade eest karmilt karistada, sisaldades kalduvust olla vihane, sallimatu, kannatamatu ja karistav kõigi nende suhtes, kes ootustele või standarditele ei vasta, the belief that people should be harshly punished for making mistakes. Involves the tendency to be angry, intolerant, punitive, and impatient with those people (including oneself) who do not meet one’s expectations or standards, Usually includes difficulty forgiving mistakes in oneself or others because of a reluctance to consider extenuating circumstances, allow for human imperfection, or empathize with feelings., Sageli kogetakse raskust endale või teistele eksimuste andestamisel, tuntakse vastumeelsust pehmendavate asjaolude arvesse võtmisel, inimliku ebatäiuslikkuse lubamisel või empaatilisel tunnetele kaasa elamisel."
    },
    {
      "term": "schema",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "lai, kõikehõlmav enda ja oma suhete kohta käiv kogum kognitiivsetest ja emotsionaalsetest mustritest, mis on kujunenud lapsepõlves või hilisemas elus ning kinnistunud läbi elu, ning need võivad olla positiivsed või negatiivsed, adaptiivsed või mitteadaptiivsed, broad, pervasive theme regarding oneself and one's relationship with others, developed during childhood or later in life and elaborated throughout one's lifetime, and it can be positive or negative, adaptive or maladaptive, However, in the context of psychology and psychotherapy, a schema can be thought of generally as any broad organizing principle for making sense of one’s life experience. An important concept with relevance for psychotherapy is the notion that schemas, many of which are formed early in life, continue to be elaborated and then superimposed on later life experiences, even when they are no longer applicable. This is sometimes referred to as the need for “cognitive consistency”, for maintaining a stable view of oneself and the world, even if it is, in reality, inaccurate or distorted. By this broad definition, a schema can be positive or negative, adaptive or maladaptive; schemas can be formed in childhood or later in life., Schemas, many of which are formed early in life, continue to be elaborated and then superimposed on later life experiences, even when they are no longer applicable. This is sometimes referred to as the need for “cognitive consistency,” for maintaining a stable view of oneself and the world, even if it is, in reality, inaccurate or distorted."
    },
    {
      "term": "schema attunement",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20attunement",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "piiritletud vanemlikkuse rakendamine läbi häälestumise (aktiveerunud) skeemiga seotud (varase arengu) emotsionaalsetele vajadustele, terapeudi oskus vastata (aktiveerunud) skeemiga seotud (varase arengu) emotsionaalsetele vajadustele, One of the most important skills of any therapist is the ability to listen and empathize. Schema therapy goes beyond the basic level of reflecting emotions to provide a higher level of understanding called schema attunement, which is attuning to the experience of schema activation"
    },
    {
      "term": "schema chemistry",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20chemistry",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": ""
    },
    {
      "term": "schema coping style",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20coping%20style",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemiga toime tulemise kolm üldist viisi - allaandmine, vältimine ja ülekompenseerimine - millest lähtuvad erinevad individuaalsed toimetulekuolekud, broad tendency to cope with schematic activation, using surrender, avoidance or overcompensation, Coping responses are the individual ways in which these broad tendencies can manifest themselves., Schema coping (styles) describe how people deal with their schemas and how schemas become obvious in their interpersonal patterns (close to the psychodynamic concept of defense mechanism)., Patients develop maladaptive coping styles and responses early in life in order to adapt to schemas, so that they do not have to experience the in-tense, overwhelming emotions that schemas usually engender. All organisms have three basic responses to threat: fight, flight, and freeze. These correspond to the three schema coping styles of overcompensation, avoidance, and surrender. In very broad terms, fight is overcompensation, flight is avoidance, and freeze is surrender."
    },
    {
      "term": "schema couples therapy",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20couples%20therapy",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemiteraapia suund, milles skeemiteraapia teooria ja meetodid on kohandatud tööks paaridega"
    },
    {
      "term": "schema dialogues",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20dialogues",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemitöö kogemuslik tehnika patsiendi ja terapeudi dialoogis düsfunktsionaalsete/mitte-kohastumuslike skeemi olekute tundmaõppimise ja korrigeerimise eesmärkidel, Therapeutic (experiential) technique in schema-changing process to track, challenge and correct the schema driven distorted interpretations in a patient-therapist collaborative dialogue of a maladaptive schema vs healthy side (i.e. role-play, chair-technique), n.ö. psüühika sisese skeemide dialoogi nähtavaks-kuuldavaks tegemine ja korrigeerimine patsient-terapeut dialoogis, kus terapeut esindab terve täiskasvanu olekut"
    },
    {
      "term": "schema domain",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20domain",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "ühte või mitut skeemi hõlmav kategooria, mis vastab spetsiifilistele emotsionaalsetele vajadustele, category of schemas that corresponds to specific emotional needs, We have grouped ... 18 schemas into 5 broad developmental categories of schemas that we call schema domains. Each of the five domains represents an important component of a child's core needs. ... When these needs are not met, schemas develop that lead to unhealthy life patterns., Skeemid on grupeeritud viide rühma, mis igaüks vastab ühele baasilisele emotsionaalsele vajadusele (seotus, autonoomsus, realistlikud piirid, vabadus väljendada end, spontaansus)."
    },
    {
      "term": "schema healing",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20healing",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "mittekohastumusliku skeemi hääbumise protsess, milles skeem nõrgeneb ning avaldab järjest vähem mõju käitumisele, Because a schema is a set of memories, emotions, bodily sensations, and cognitions, schema healing involves diminishing all of these: the intensity of the memories connected to the schema, the schema’s emotional charge, the strength of the bodily sensations, and the maladaptive cognitions. Schema healing also involves behavior change, as patients learn to replace maladaptive coping styles with adaptive patterns of behavior. As a schema heals, it becomes increasingly more difficult to activate. When it is activated, the experience is less overwhelming, and the patient recovers more quickly., By repetition and exercise they build up new neural footprints and modify the old schemas, or at least the activation of them. This is what “schema healing” is about."
    },
    {
      "term": "schema mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20mode",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "käesolev emotsionaalne, kognitiivne ja käitumuslik seisund, milles inimene parasjagu on, kui üks või mitu skeemi on aktiveeritud, the current emotional, cognitive, and behavioral state that a person is in when a schema is activated, Moment-to-moment emotional states and coping responses that we all experience. Often our schema modes are triggered by life situations that we are oversensitive to (our \"emotional buttons\"). Many schema modes lead us to overreact to situations, or to act in ways that end up hurting us., Ajaliselt piiratud seisund, mis viitab kindlas ajahetkes aktiveerunud valdavale emotsionaalsele seisundile, skeemile või toimetulekureaktsioonile."
    },
    {
      "term": "schema model",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20model",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "probleemide kontseptualiseerimise viis, seostades varaseid mittekohastumuslikke skeeme toimetulekustiilidega, tuues välja nende tekkepõhjused varases lapsepõlves ja kavandades selle põhjal sekkumine, Accounts for chronic, pervasive characterological patterns in terms of both schemas and coping responses; it relates the schemas and coping responses to their origins in early childhood; and it provides direct and clear implications to the treatment., Overlaps with many other models of psychopathology and psychotherapy, including cognitive-behavioral, constructivist, psychodynamic, object relations, and Gestalt approaches."
    },
    {
      "term": "schema perpetuation",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20perpetuation",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemi säilimise protsess, milles mõtted, tunded ja käitumine kinnistavad olemasolevat skeemi, Refers to everything the patient does (internally and behaviorally) that keeps the schema going - thus elaborating and reinforcing it. Perpetuation includes all the thoughts, feelings, and behaviors that end up reinforcing rather than healing the schema., Schemas are perpetuated through three primary mechanisms: cognitive distortions, self-defeating life patterns, and schema coping styles."
    },
    {
      "term": "schema therapy",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20therapy",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "Schema therapy is an innovative, integrative therapy developed by Young and colleagues (Young, 1990, 1999) that significantly expands on traditional cognitive-behavioral treatments and concepts. The therapy blends elements from cognitive-behavioral, attachment, Gestalt, object relations, constructivist, and psychoanalytic schools into a rich, unifying conceptual and treatment model., integratiivne teraapiamudel, mis adresseerib varases arengus oluliste emotsionaalsete vajaduste rahuldamatuse korral kujunenud mittekohastumuslikke skeeme ja nende avaldumise olekuid"
    },
    {
      "term": "schema trigger",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/schema%20trigger",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "tegur, mis aktiveerib skeemi, Studies on the biology of the brain indicate locations at which schema triggering based on traumatic childhood events such as abandonment or abuse might occur in the brain. When patients surrender to a schema, they yield to it. They do not try to avoid it or fight it. They accept that the schema is true. They feel the emotional pain of the schema directly. They act in ways that confirm the schema. Without realizing what they are doing, they repeat schema-driven patterns so that, as adults, they continue to relive the childhood experiences that created the schema. When they encounter schema triggers, their emotional responses are disproportionate, and they experience their emotions fully and consciously., A common instance of schema triggering appears in what Safran and Muran (1996) call ‘‘therapeutic ruptures.’’ In such ruptures, the bond between the patient and the therapist deteriorates, sometimes very rapidly."
    },
    {
      "term": "secure attachment",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/secure%20attachment",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus olla turvalises suhtes, mis sisaldab võimalust olla hoitud, märgatud, armastatud, mõistetud, aksepteeritud, tunnustatud, kaitstud, valideeritud ning kogeda turvatunnet, ennustatavust, stabiilsust, empaatiat suhetes oluliste teistega, The feeling that we are safe, nurtured, there is stability in our home life and we are accepted by our parents"
    },
    {
      "term": "self-aggrandizer mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/self-aggrandizer%20mode",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mida iseloomustavad arrogantne enese üle- ja teiste alahindamine, The Self-Aggrandizer mode is an overcompensation for the patient’s feelings of emotional deprivation and defectiveness. When patients are in this mode, they behave in entitled, competitive, grandiose, abusive, or status-seeking ways., Käitutakse viisidel, mis rõhutab enese õigust teha või omada, mida tahetakse sõltumata teiste arvamusest või kõigile (teistele) kehtivatest reeglitest. Praalitakse ennast ülistades ja mustatakse teisi enesehinnangu tõstmiseks. Vähene empaatia teiste vajaduste või tunnete suhtes, võistluslikkus, imetluse iha ja kriitilisus on mõned näited selle oleku käitumisvalikutest., Selles olekus võetakse kergesti domineeriv, teiste suhtes ülalt-alla positsioon kompenseerimaks alaväärsuse, kõlbmatu või puudulik olemise ja emotsionaalse deprivatsiooni tundeid"
    },
    {
      "term": "self-compassion",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/self-compassion",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "oma eksimuste suhtes andestav olemine, forgiving oneself for mistakes"
    },
    {
      "term": "self-directedness",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/self-directedness",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et iseendale olulised väärtused on tähtsad vajaduseta teistelt heakskiitu pälvida, valuing what matters to oneself without the need of having others notice"
    },
    {
      "term": "self-sacrifice",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/self-sacrifice",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et teiste vajaduste rahuldamisele on oluline keskenduda kasvõi iseenda vajaduste rahuldamise arvelt vältimaks teistele valu või kannatuste põhjustamist, süütunnet isekas olemise pärast või säilitamaks suhteid nendega, keda tajutakse emotsionaalset tuge vajavatena, excessive focus on voluntarily meeting the needs of others in daily situations at the expense of one’s own gratification, Sageli kujuneb (nimetatud skeem) tundlikkuse tõttu teiste valu suhtes. On võimalik, et oma vajadustele asjakohase tähelepanu puudumise tulemusena hakatakse põlgama neid, keda aidatakse., The most common reasons are: to prevent causing pain to others; to avoid guilt from feeling selfish; or to maintain the connection with others perceived as needy. Often results from an acute sensitivity to the pain of others. Sometimes leads to a sense that one’s own needs are not being adequately met and to resentment of those who are taken care of."
    },
    {
      "term": "sense of identity",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/sense%20of%20identity",
      "letter": "s",
      "language": "inglise",
      "synonyms": [
        "autonomy",
        "competence"
      ],
      "definition": "baasiline emotsionaalne vajadus autonoomia, kompetentsus- ja identiteeditunde järele, mis sisaldab võimalust sooritada iseseisvalt eakohaseid ülesandeid ning saada eakohast juhendamist ja tagasisidet, Being able to develop age appropriate tasks on your own, getting useful feedback and support to do this"
    },
    {
      "term": "shame",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/shame",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "hingepiin, kahetsus või piinlikkus, mille on tinginud sobimatu käitumine, ebaväärikas tegu, alandav olukord vms"
    },
    {
      "term": "siirdeobjekt",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/siirdeobjekt",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "ese, mis pakub lapsele kindlustunnet, nt kaisuasi"
    },
    {
      "term": "sisemise kriitiku olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/sisemise%20kriitiku%20olek",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks kategooria skeemi olekutest, mis on lapsepõlves olulistes suhetes (lapsevanem, vm oluline isik) kogetud negatiivsete aspektide valikuline internaliseerumine, Dysfunctional Parent Modes reflect the selective internalization of negative aspects of attachment figures (e.g., parents, teachers, peers, etc.) during childhood and adolescence (p. 7), These modes have in common an internalized parental \"voice\" that criticizes or denigrates the patient (Punitive Parent) or places almost impossible demands on him (Demanding or Critical Parent) (p. 63), In these modes, the patient becomes like the parent who has been internalized (p. 44), Dysfunctional parent modes are viewed as internalizations of dysfunctional parental responses to the child. Conceptually, these modes overlap with the notion of (perpetrator) introjects in psychodynamic theory (p. 36)"
    },
    {
      "term": "skeem",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeem",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "tinglik, lihtsustatud graafiline kujutis (nt pilt, joonis), mis kirjeldab mingit protsessi, nähtust, seadme tööd vm"
    },
    {
      "term": "skeemi dialoog",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemi%20dialoog",
      "letter": "s",
      "language": "eesti",
      "synonyms": [
        "skeemide dialoog"
      ],
      "definition": "skeemitöö kogemuslik tehnika patsiendi ja terapeudi dialoogis düsfunktsionaalsete/mitte-kohastumuslike skeemi olekute tundmaõppimise ja korrigeerimise eesmärkidel, Therapeutic (experiential) technique in schema-changing process to track, challenge and correct the schema driven distorted interpretations in a patient-therapist collaborative dialogue of a maladaptive schema vs healthy side (i.e. role-play, chair-technique), n.ö. psüühika sisese skeemide dialoogi nähtavaks-kuuldavaks tegemine ja korrigeerimine patsient-terapeut dialoogis, kus terapeut esindab terve täiskasvanu olekut"
    },
    {
      "term": "skeemi mudel",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemi%20mudel",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "probleemide kontseptualiseerimise viis, seostades varaseid mittekohastumuslikke skeeme toimetulekustiilidega, tuues välja nende tekkepõhjused varases lapsepõlves ja kavandades selle põhjal sekkumine, Accounts for chronic, pervasive characterological patterns in terms of both schemas and coping responses; it relates the schemas and coping responses to their origins in early childhood; and it provides direct and clear implications to the treatment., Overlaps with many other models of psychopathology and psychotherapy, including cognitive-behavioral, constructivist, psychodynamic, object relations, and Gestalt approaches."
    },
    {
      "term": "skeemi olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemi%20olek",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "käesolev emotsionaalne, kognitiivne ja käitumuslik seisund, milles inimene parasjagu on, kui üks või mitu skeemi on aktiveeritud, the current emotional, cognitive, and behavioral state that a person is in when a schema is activated, Moment-to-moment emotional states and coping responses that we all experience. Often our schema modes are triggered by life situations that we are oversensitive to (our \"emotional buttons\"). Many schema modes lead us to overreact to situations, or to act in ways that end up hurting us., Ajaliselt piiratud seisund, mis viitab kindlas ajahetkes aktiveerunud valdavale emotsionaalsele seisundile, skeemile või toimetulekureaktsioonile."
    },
    {
      "term": "skeemi paranemine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemi%20paranemine",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "mittekohastumusliku skeemi hääbumise protsess, milles skeem nõrgeneb ning avaldab järjest vähem mõju käitumisele, Because a schema is a set of memories, emotions, bodily sensations, and cognitions, schema healing involves diminishing all of these: the intensity of the memories connected to the schema, the schema’s emotional charge, the strength of the bodily sensations, and the maladaptive cognitions. Schema healing also involves behavior change, as patients learn to replace maladaptive coping styles with adaptive patterns of behavior. As a schema heals, it becomes increasingly more difficult to activate. When it is activated, the experience is less overwhelming, and the patient recovers more quickly., By repetition and exercise they build up new neural footprints and modify the old schemas, or at least the activation of them. This is what “schema healing” is about."
    },
    {
      "term": "skeemi põlistumine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemi%20p%C3%B5listumine",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemi säilimise protsess, milles mõtted, tunded ja käitumine kinnistavad olemasolevat skeemi, Refers to everything the patient does (internally and behaviorally) that keeps the schema going - thus elaborating and reinforcing it. Perpetuation includes all the thoughts, feelings, and behaviors that end up reinforcing rather than healing the schema., Schemas are perpetuated through three primary mechanisms: cognitive distortions, self-defeating life patterns, and schema coping styles."
    },
    {
      "term": "skeemi valdkond",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemi%20valdkond",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "ühte või mitut skeemi hõlmav kategooria, mis vastab spetsiifilistele emotsionaalsetele vajadustele, category of schemas that corresponds to specific emotional needs, We have grouped ... 18 schemas into 5 broad developmental categories of schemas that we call schema domains. Each of the five domains represents an important component of a child's core needs. ... When these needs are not met, schemas develop that lead to unhealthy life patterns., Skeemid on grupeeritud viide rühma, mis igaüks vastab ühele baasilisele emotsionaalsele vajadusele (seotus, autonoomsus, realistlikud piirid, vabadus väljendada end, spontaansus)."
    },
    {
      "term": "skeemi vallandaja",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemi%20vallandaja",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "tegur, mis aktiveerib skeemi, Studies on the biology of the brain indicate locations at which schema triggering based on traumatic childhood events such as abandonment or abuse might occur in the brain. When patients surrender to a schema, they yield to it. They do not try to avoid it or fight it. They accept that the schema is true. They feel the emotional pain of the schema directly. They act in ways that confirm the schema. Without realizing what they are doing, they repeat schema-driven patterns so that, as adults, they continue to relive the childhood experiences that created the schema. When they encounter schema triggers, their emotional responses are disproportionate, and they experience their emotions fully and consciously., A common instance of schema triggering appears in what Safran and Muran (1996) call ‘‘therapeutic ruptures.’’ In such ruptures, the bond between the patient and the therapist deteriorates, sometimes very rapidly."
    },
    {
      "term": "skeemide dialoog",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemide%20dialoog",
      "letter": "s",
      "language": "eesti",
      "synonyms": [
        "skeemi dialoog"
      ],
      "definition": "skeemitöö kogemuslik tehnika patsiendi ja terapeudi dialoogis düsfunktsionaalsete/mitte-kohastumuslike skeemi olekute tundmaõppimise ja korrigeerimise eesmärkidel, Therapeutic (experiential) technique in schema-changing process to track, challenge and correct the schema driven distorted interpretations in a patient-therapist collaborative dialogue of a maladaptive schema vs healthy side (i.e. role-play, chair-technique), n.ö. psüühika sisese skeemide dialoogi nähtavaks-kuuldavaks tegemine ja korrigeerimine patsient-terapeut dialoogis, kus terapeut esindab terve täiskasvanu olekut"
    },
    {
      "term": "skeemide keemia",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemide%20keemia",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": ""
    },
    {
      "term": "skeemiga toimetuleku stiil",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemiga%20toimetuleku%20stiil",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemiga toime tulemise kolm üldist viisi - allaandmine, vältimine ja ülekompenseerimine - millest lähtuvad erinevad individuaalsed toimetulekuolekud, broad tendency to cope with schematic activation, using surrender, avoidance or overcompensation, Coping responses are the individual ways in which these broad tendencies can manifest themselves., Schema coping (styles) describe how people deal with their schemas and how schemas become obvious in their interpersonal patterns (close to the psychodynamic concept of defense mechanism)., Patients develop maladaptive coping styles and responses early in life in order to adapt to schemas, so that they do not have to experience the in-tense, overwhelming emotions that schemas usually engender. All organisms have three basic responses to threat: fight, flight, and freeze. These correspond to the three schema coping styles of overcompensation, avoidance, and surrender. In very broad terms, fight is overcompensation, flight is avoidance, and freeze is surrender."
    },
    {
      "term": "skeemikeemia",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemikeemia",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": ""
    },
    {
      "term": "skeemile häälestatus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemile%20h%C3%A4%C3%A4lestatus",
      "letter": "s",
      "language": "eesti",
      "synonyms": [
        "skeemile häälestumine"
      ],
      "definition": "piiritletud vanemlikkuse rakendamine läbi häälestumise (aktiveerunud) skeemiga seotud (varase arengu) emotsionaalsetele vajadustele, terapeudi oskus vastata (aktiveerunud) skeemiga seotud (varase arengu) emotsionaalsetele vajadustele, One of the most important skills of any therapist is the ability to listen and empathize. Schema therapy goes beyond the basic level of reflecting emotions to provide a higher level of understanding called schema attunement, which is attuning to the experience of schema activation"
    },
    {
      "term": "skeemile häälestumine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemile%20h%C3%A4%C3%A4lestumine",
      "letter": "s",
      "language": "eesti",
      "synonyms": [
        "skeemile häälestatus"
      ],
      "definition": "piiritletud vanemlikkuse rakendamine läbi häälestumise (aktiveerunud) skeemiga seotud (varase arengu) emotsionaalsetele vajadustele, terapeudi oskus vastata (aktiveerunud) skeemiga seotud (varase arengu) emotsionaalsetele vajadustele, One of the most important skills of any therapist is the ability to listen and empathize. Schema therapy goes beyond the basic level of reflecting emotions to provide a higher level of understanding called schema attunement, which is attuning to the experience of schema activation"
    },
    {
      "term": "skeemile järele andmine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemile%20j%C3%A4rele%20andmine",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "reageerimise viis, mille puhul inimene toimib aktiveerunud skeemi kohaselt, uskudes täielikult selle tähendust, the way of the schema handling where the person gives in to the early maladaptive schema activation and fully believes to the early maladaptive schema, To understand how schemas work, three schema maintenance processes must be defined. These processes are schema support, schema avoidance, and schema compensation. Through these three processes, schemas exert their influence on our behaviour and work to ensure their survival."
    },
    {
      "term": "skeemile vastandumine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemile%20vastandumine",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "the way of the schema handling where the person deals with EMS activation by believing the opposite of the EMS is true, reageerimise viis, mille puhul inimene toimib vastupidiselt aktiveerunud skeemile, uskudes skeemi vastandlikku tähendust"
    },
    {
      "term": "skeemiteraapia",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/skeemiteraapia",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "psühhoteraapia valdkond, mis tegeleb inimestega, kelle emotsionaalsed või käitumuslikud probleemid on tugevasti seotud nende lapsepõlve ja noorukieaga"
    },
    {
      "term": "social belonging",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/social%20belonging",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et ollakse teistega seotud ja nende poolt aktsepteeritud, feeling of acceptance by and connection to others"
    },
    {
      "term": "social Isolation",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/social%20Isolation",
      "letter": "s",
      "language": "inglise",
      "synonyms": [
        "alienation"
      ],
      "definition": "eeldus, et ollakse muust maailmast isoleeritud, teistest erinev sel määral, et ei kuuluta ühtegi gruppi või kogukonda, the feeling that one is isolated from the rest of the world, different from other people, and/or not part of any group or community, Individuals with this schema feel different from other people, and/or not part of any group or community. Though this schema reflects the same unmet needs (for safety, stability, and acceptance) as the other four in this domain, it typically comes about as a result of social exclusion outside the home environment (though at times, this social exclusion can be traced back to parental influences: a lack of encouragement for socializing, intense shame about one’s home and background, or a sense of defectiveness and unlovability that emerges within the family of origin but is generalized to other situations)"
    },
    {
      "term": "sotsiaalne isoleeritus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/sotsiaalne%20isoleeritus",
      "letter": "s",
      "language": "eesti",
      "synonyms": [
        "võõrandumine"
      ],
      "definition": "eeldus, et ollakse muust maailmast isoleeritud, teistest erinev sel määral, et ei kuuluta ühtegi gruppi või kogukonda, the feeling that one is isolated from the rest of the world, different from other people, and/or not part of any group or community, Individuals with this schema feel different from other people, and/or not part of any group or community. Though this schema reflects the same unmet needs (for safety, stability, and acceptance) as the other four in this domain, it typically comes about as a result of social exclusion outside the home environment (though at times, this social exclusion can be traced back to parental influences: a lack of encouragement for socializing, intense shame about one’s home and background, or a sense of defectiveness and unlovability that emerges within the family of origin but is generalized to other situations)"
    },
    {
      "term": "sotsiaalne kokkukuuluvus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/sotsiaalne%20kokkukuuluvus",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "eeldus, et ollakse teistega seotud ja nende poolt aktsepteeritud, feeling of acceptance by and connection to others"
    },
    {
      "term": "spontaansus ja mäng",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/spontaansus%20ja%20m%C3%A4ng",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus olla spontaanne ja mängida, Having the opportunity to learn through play and enjoyable activities"
    },
    {
      "term": "Spontaneity and play",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/Spontaneity%20and%20play",
      "letter": "S",
      "language": "inglise",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus olla spontaanne ja mängida, Having the opportunity to learn through play and enjoyable activities"
    },
    {
      "term": "stable attachment",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/stable%20attachment",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "võime usaldada teisi ja kindlus (lähi)suhete püsivuse suhtes, confidence that (close) relationships will maintain and ability to trust others"
    },
    {
      "term": "subjugation",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/subjugation",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et iseenda soovid, arvamused ja tunded ei ole teiste silmis õigustatud või olulised ning sellest tulenevalt allutatakse end teistele vältimaks kardetavat kättemaksu, hülgamist või viha osaliseks saamist, excessive surrendering of control to others because one feels coerced—submitting in order to avoid anger, retaliation, or abandonment, The patient submits to the control of others in order to avoid negative consequences. The patient ignores his own needs because he fears conflict and punishment (van Vreeswijk et al., 2012, p.30). Over time, compensatory beliefs become maladaptive and reinforce the central beliefs. For example, a subjugation schema might develop to protect an individual from the negative impact of mistrust/abuse core beliefs that resulted from an abusive early environment. However, a style of letting others be in control leaves the individual vulnerable to further abuse later in life, thus reinforcing the mistrust/ abuse belief., Peamiselt loovutatakse kontroll kahes valdkonnas: (a) vajadused: isiklike eelistuste, otsuste ja soovide allutamine/allasurumine; (b) emotsioonid: emotsioonide väljendamise, eelkõige viha allasurumine. Skeem sisaldab tavapäraselt uskumust, et iseenda soovid, arvamused ja tunded ei ole teiste silmis õigustatud või olulised. Skeem väljendub sageli ülemäärase pärioleku ja järeleandlikkuse kalduvusena, mis on kombineeritud ülitundlikkusega lõksus olemise tunnete suhtes. See päädib vihatunnete kuhjumisena, mis omakorda väljenduvad vähekohastumuslike sümptomitena (nt passiiv-agressiivne käitumine, kontrollimatud pahameele väljaelamised, psühhosomaatilised sümptomid, lähedusest hoidumine/eemaldumine, väljaelamine käitumisse või ainete kuritarvitamine., The two major forms of subjugation are: A. Subjugation of needs: Suppression of one’s preferences, decisions, and desires. B. Subjugation of emotions: Suppression of emotions, especially anger. Usually involves the perception that one’s own desires, opinions, and feelings are not valid or important to others. Frequently presents as excessive compliance, combined with hypersensitivity to feeling trapped. Generally leads to a buildup of anger, manifested in maladaptive symptoms (e.g., passive–aggressive behavior, uncontrolled outbursts of temper, psychosomatic symptoms, withdrawal of affection, “acting out,” substance abuse)."
    },
    {
      "term": "success",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/success",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "olukord, kui miski õnnestub, hästi läheb või edeneb, hrl soovitud, loodetud tulemuste poolest, sellega kaasnev menu, tunnustus"
    },
    {
      "term": "surrender",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/surrender",
      "letter": "s",
      "language": "inglise",
      "synonyms": [],
      "definition": "skeemiga toime tulemise viis, mis sisaldab aktiveerunud skeemile passiivset ja abitut allumist, a broad tendency to give in to the triggered schema or schemas, wchich can manifest itself in a variety of specific surrendering coping responses, instead of fighting against the schemas in a healthy way, the surrendering persona submits to them, passively and helplessly giving into them, a person acts as if the schema were true and surrenders into the subsequent behavior patterns."
    },
    {
      "term": "suurustaja olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/suurustaja%20olek",
      "letter": "s",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mida iseloomustavad arrogantne enese üle- ja teiste alahindamine, The Self-Aggrandizer mode is an overcompensation for the patient’s feelings of emotional deprivation and defectiveness. When patients are in this mode, they behave in entitled, competitive, grandiose, abusive, or status-seeking ways., Käitutakse viisidel, mis rõhutab enese õigust teha või omada, mida tahetakse sõltumata teiste arvamusest või kõigile (teistele) kehtivatest reeglitest. Praalitakse ennast ülistades ja mustatakse teisi enesehinnangu tõstmiseks. Vähene empaatia teiste vajaduste või tunnete suhtes, võistluslikkus, imetluse iha ja kriitilisus on mõned näited selle oleku käitumisvalikutest., Selles olekus võetakse kergesti domineeriv, teiste suhtes ülalt-alla positsioon kompenseerimaks alaväärsuse, kõlbmatu või puudulik olemise ja emotsionaalse deprivatsiooni tundeid"
    },
    {
      "term": "sõltumine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/s%C3%B5ltumine",
      "letter": "s",
      "language": "eesti",
      "synonyms": [
        "rektsioon"
      ],
      "definition": "grammatiline seos lauses, kus põhisõna tähendus määrab laiendi vormi (käände, kaassõnafraasi) (nt hoolib sõpradest – kellest? hirm vananemise ees – mille ees?)"
    },
    {
      "term": "tajutud ebaõiglus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/tajutud%20eba%C3%B5iglus",
      "letter": "t",
      "language": "eesti",
      "synonyms": [],
      "definition": "varane mittekohastumuslik skeem, mida iseloomustab maailma ja teiste tajumine moraalitu ja ebaõiglasena, vääritut, moraalselt ebaõiget ja -õiglast käitumist lubavana ja ennast \"süsteemi\" ohvrina, early maladaptive schema as a fundamental representation of the world (including but not necessarily restricted to other people as being unfair and unjust, the society as lacking justice, thus not correcting those that behave unfairly, and the self as a continuous victim of unfairness"
    },
    {
      "term": "teistele suunatud sallimatu karistavus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/teistele%20suunatud%20sallimatu%20karistavus",
      "letter": "t",
      "language": "eesti",
      "synonyms": [],
      "definition": "varane mittekohastumuslik skeem, mida iseloomustavad hõivatus õigluse põhimõttest, vaenulikkus teiste vigade, kannatuse ja ebatäiuslikkuse suhtes ning uskumus, et teisi tuleb karistada või vastutusele võtta nende eksimuste eest eirates leevendavaid asjaolusid, hypercriticalness towards others’ mistakes, suffering, or imperfections. Involves a belief that others should be punished or held accountable for their indiscretions, a tendency to ignore extenuating circumstances and naturally human error, and a preoccupation with concepts of justice"
    },
    {
      "term": "teistele suunatus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/teistele%20suunatus",
      "letter": "t",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on äärmuslik teiste soovidele, tunnetele ja reaktsioonidele keskendumine iseenda vajaduste arvelt eesmärgiga saada armastust või heakskiitu, säilitada tajutud seotust või vältida kardetavat kättemaksu, An excessive focus on the desires, feelings, and responses of others, at the expense of one’s own needs in order to gain love and approval, maintain one’s sense of connection, or avoid retaliation., Selle valdkonna skeemid kujunevad sageli varases kasvukeskkonnas, mida iseloomustab tingimuslik aktsepteerimine: laps peab alla suruma enda jaoks olulisi aspekte selleks, et saada armastust, tähelepanu, heakskiitu. Sageli hõlmab see oma viha ja loomulike reaktsioonide allasurumist või vähest teadlikkust neist., (This domain) involves schemas related to deficits in the fulfillment of the basic universal need for self-directness. Such deficits lead to an excessive focus on the desires, feelings, and responses of others, at the expense of one’s own needs. This focus is driven by the need to gain love and approval, maintain a sense of connection or belonging, or avoid retaliation. These schemas usually involve a suppression or lack of awareness regarding one’s own emotions, needs, or wishes, and lead to difficulties in assertion or self-determination. They often emerge when children are brought up in an atmosphere of conditional positive regard or conditional acceptance: the child needed to suppress important aspects of the self in order to gain love, attention, or approval. In many cases, the parents’ emotional needs and desires – or social acceptance and status – were valued more than the unique needs and feelings of each child., Usually involves suppression and lack of awareness regarding one’s own anger and natural inclinations"
    },
    {
      "term": "terve täiskasvanu olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/terve%20t%C3%A4iskasvanu%20olek",
      "letter": "t",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks funktsionaalsetest olekutest, mida iseloomustab toimetulevus ja tugevus; hõlmab kohastumuslikke vastuseid ümbritsevale keskkonnale, mis on vajalikud selleks, et täide viia täiskasvanud inimese igapäevaseid tegevusi nagu töölkäimine, vanemlus, vastutuse võtmine, tegevustele ja inimestele pühendumine, ning püüdleb täiskasvanulikke naudinguid nagu intellektuaalsed, esteetilised, kultuurilised huvid, seks, tervise hoidmine ja sportlikud tegevused, the part of the self that is capable, strong, and well-functioning which includes those functional cognitions and behaviors that are needed to carry out appropriate adult functions such as working, parenting, taking responsibility, and committing to both people and actions. This part of the self is also the one that pursues pleasurable adult activities such as intellectual, aesthetic, and cultural interests, sex, health maintenance, and athletic activities"
    },
    {
      "term": "toolidialoog",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/toolidialoog",
      "letter": "t",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks toolitehnika, milles kasutatakse toole erinevate olekute ja skeemide esindusena nende teadvustamise, nendevahelise suhtluse käivitamise ja muutmise eesmärgil, experiential technique in schema therapy which involves the use of chairs to represent different modes. ...a dialogue between the client's different sides"
    },
    {
      "term": "toolitehnika",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/toolitehnika",
      "letter": "t",
      "language": "eesti",
      "synonyms": [],
      "definition": "terapeutiline tehnika, millega soodustatakse erinevate olekute, mälestuste, rollide vm osade vahelist suhtlust, seda toolide abil operatsionaliseerides, What is chairwork? At its most essential, there are two basic forms of psychotherapeutic dialogue. In the first, known as the “empty chair” dialogue, the patient is invited to sit in one chair and to imagine a person in the opposite chair. Typically, this is a person with whom they have some kind of “unfinished business” or unresolved emotional connection. In the second form, the patient is often working with inner conflicts. In the case of a decision, they can express a viewpoint in one chair and then switch to the one opposite to express the alternative view. This is known as the two-chair dialogue. It is, perhaps, time to let go of this convention and organize our use of these therapeutic encounters in terms of whether they are “external” or “internal”; that is, did the therapist ask the patient to dialogue with a person or object outside of him- or herself or with an internal force or experience?, With the next cognitive technique, patients learn to conduct dialogues between their “schema side” and “healthy side.” Adapting the Gestalt “empty chair” technique, the therapist instructs patients to switch chairs as they play the two sides: In one chair they play the schema side, in the other they play the healthy side."
    },
    {
      "term": "transitional objects",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/transitional%20objects",
      "letter": "t",
      "language": "inglise",
      "synonyms": [],
      "definition": "esemed, tegevused jm, mida kasutatakse teraapia protsessis, et märgistada ja võimaldada seotuse, hoituse ja olulisuse tunnete (taas)kogemist haavatava lapse oleku aktiveerumisel väljaspool teraapiakohtumisi ja internaliseerida terapeut terve täiskasvanu oleku (psüühika sisese) esindusena, Any object or technique used (in context of reparenting and extra reparentingin in the therapeutic relationship) to comfort and nurture the Vulnerable Child and reinforce a sense of connectedness and care in order to help the patient to stay in contact with the vulnerable child mode (and with the therapist, even when they are not present) and internalize the therapist as a healthy adult mode, Igasugune (varasema arenguperioodi päritolu seotuse, hoituse ja olulisuse tunde taaskogemist võimaldav) tegevus ja/või objekt, mis toimib psüühilisi protsesse korrastava/organiseeriva ja rahustavana."
    },
    {
      "term": "turvaline seotus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/turvaline%20seotus",
      "letter": "t",
      "language": "eesti",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus olla turvalises suhtes, mis sisaldab võimalust olla hoitud, märgatud, armastatud, mõistetud, aksepteeritud, tunnustatud, kaitstud, valideeritud ning kogeda turvatunnet, ennustatavust, stabiilsust, empaatiat suhetes oluliste teistega, The feeling that we are safe, nurtured, there is stability in our home life and we are accepted by our parents"
    },
    {
      "term": "undeveloped self",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/undeveloped%20self",
      "letter": "u",
      "language": "inglise",
      "synonyms": [
        "enmeshment"
      ],
      "definition": "ülemäärane emotsionaalne seotus ja lähedus ühe või enama olulise lähedasega (sageli vanematega) ootuspärase sotsiaalse arengu või täieliku iseseisvumise ja selge identiteedi kujunemise arvelt, excessive emotional involvement and closeness with one or more significant others (often parents) at the expense of full individuation or normal social development, Sageli esineb veendumus, et vähemalt üks üleseotud isikutest ei tule toime või ei saa olla õnnelik teise pideva toeta. Võib tunduda, et ollakse rõhutud, alla surutud või teistega sulandunud ja selge individuaalse identiteedita. Sageli kogetakse sisemist tühjust, suuna ja eesmärkide puudumist, takerdumise ja põhja vajumise tundeid, äärmuslikematel juhtudel seatakse kahtluse alla elu ja eksistentsi mõttekus, Often involves the belief that at least one of the enmeshed individuals cannot survive or be happy without the constant support of the other. May also include feelings of being smothered by or fused with others or insufficient individual identity. Often experienced as a feeling of emptiness and foundering, having no direction, or in extreme cases questioning one’s existence"
    },
    {
      "term": "undisciplined child mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/undisciplined%20child%20mode",
      "letter": "u",
      "language": "inglise",
      "synonyms": [],
      "definition": "lapse olek, milles ei suudeta taluda frustratsiooni ega sundida end lõpetama rutiinseid või igavaid ülesandeid ning selles olekus ei taluta rahulolematust või ebamugavust (valu, konflikti, pingetunnet), The patient has no tolerance of frustration and cannot force himself to finish routine or boring tasks. He cannot bear dissatisfaction or discomfort (pain, conflict, or overexertion) and he behaves like a spoiled child."
    },
    {
      "term": "unfairness",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/unfairness",
      "letter": "u",
      "language": "inglise",
      "synonyms": [],
      "definition": "varane mittekohastumuslik skeem, mida iseloomustab maailma ja teiste tajumine moraalitu ja ebaõiglasena, vääritut, moraalselt ebaõiget ja -õiglast käitumist lubavana ja ennast \"süsteemi\" ohvrina, early maladaptive schema as a fundamental representation of the world (including but not necessarily restricted to other people as being unfair and unjust, the society as lacking justice, thus not correcting those that behave unfairly, and the self as a continuous victim of unfairness"
    },
    {
      "term": "unrelenting standards",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/unrelenting%20standards",
      "letter": "u",
      "language": "inglise",
      "synonyms": [
        "hypercriticalness"
      ],
      "definition": "eeldus, et peab vastama väga kõrgetele internaliseerunud sisemistele käitumise ja sooritusega seotud standarditele vältimaks (võimaliku) kriitika osaliseks saamist, the underlying belief that one must strive to meet very high internalized standards of behavior and performance, usually to avoid criticism, Typically results in feelings of pressure or difficulty slowing down and in hypercriticalness toward oneself and others. Must involve significant impairment in pleasure, relaxation, health, self-esteem, sense of accomplishment, or satisfying relationships. Unrelenting standards typically present as (a) perfectionism, inordinate attention to detail, or an underestimate of how good one’s own performance is relative to the norm; (b) rigid rules and “shoulds” in many areas of life, including unrealistically high moral, ethical, cultural, or religious precepts; or (c) preoccupation with time and efficiency, the need to accomplish more (p. 17), Tüüpiliselt kaasnevad pingetunne, raskused puhata ja rõõmu tunda, ülim kriitilisus nii iseenda kui teiste suhtes. Kahjustatud on üldine tervis, enesehinnang ja võimelisus eneseteostuseks ning rahuldust pakkuvateks suheteks. Jäigad standardid väljenduvad: (a) täiuslikkuse püüdlusena, ülemäärases tähelepanus detailide suhtes või enese soorituse alahindamises normiga võrreldes; (b) rigiidsetes reeglites ja \"nii peab/on õige\" sõnumites elu erinevate valdkondade kohta, seejuures ebarealistlikult kõrgetes moraalsetes nõudmistes, eetilistes, kultuurilistes või religioossetes ettekirjutustes; või selles, et (c) ollakse üle hõivatud aja kasu ja tõhususe küsimustega vajadusest saavutada enamat."
    },
    {
      "term": "usaldamatus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/usaldamatus",
      "letter": "u",
      "language": "eesti",
      "synonyms": [
        "umbusaldus",
        "umbusk"
      ],
      "definition": "kahtlev suhtumine, usalduse puudumine"
    },
    {
      "term": "vabadus väljendada vajadusi ja emotsioone",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/vabadus%20v%C3%A4ljendada%20vajadusi%20ja%20emotsioone",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus väljendada vabalt oma vajadusi, emotsioone ja mõtteid ja saada selles valideeritud, Having the freedom to express your feelings and basic needs. Expressing ourselves without being scared of negative reactions"
    },
    {
      "term": "vajadus mina-pildi terviklikkuse järele",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/vajadus%20mina-pildi%20terviklikkuse%20j%C3%A4rele",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus kooskõlalise identiteedi ning mõtestatud ja tähendusliku maailmatunnetuse järele, desire to feel psychologically intact and rooted. It is about the need for experiencing the self as integrated and the world as meaningful, in relation to the person"
    },
    {
      "term": "vajadus õigluse järele",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/vajadus%20%C3%B5igluse%20j%C3%A4rele",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "baasiline emotsionaalne vajadus olla koheldud võrdselt, moraalselt, samaväärselt ja/või õigustatult, the need for sameness, where everything is kept equal by being the same but can also mean \"deservedness\" meaning a person gets what they deserve"
    },
    {
      "term": "varane kohastumuslik skeem",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/varane%20kohastumuslik%20skeem",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "lai, kõikehõlmav enda ja oma suhete kohta käiv emotsioonidest, kognitsioonidest ja kehalistest aistingutest koosnev muster, mis kujuneb varases arengus lapse baasiliste emotsionaalsete vajaduste rahuldamisel (esmaselt) oluliste täiskasvanute poolt, are hypothesized to develop when the core emotional needs of a child are met early in life by primary caregivers"
    },
    {
      "term": "varane mittekohastumuslik skeem",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/varane%20mittekohastumuslik%20skeem",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "lai, kõikehõlmav enda ja oma suhete kohta käiv mälestustest, emotsioonidest, kognitsioonidest ja kehalistest aistingutest koosnev muster, mis on kujunenud lapsepõlves või noorukieas ning kinnistunud läbi elu ning on olulisel määral düsfunktsionaalne, a broad, pervasive theme or pattern regarding oneself and one’s relationships with others, comprised of memories, emotions, cognitions, and bodily sensations, developed during childhood or adolescence, elaborated throughout one’s lifetime and dysfunctional to a significant degree, Lapsepõlves on sellised skeemid tihti kohanemiseks vajalikud, kuid täiskasvanueas muutuvad need kohanemist raskendavaks ja toimetulekut piiravaks ning on enamasti inimese enda poolt teadvustamata., Maladaptive schemas are psychological constructs that include beliefs we have about ourselves, the world, and other people, which result from interactions of unmet core childhood needs, innate temperament, and early environment. These schemas often have an adaptive role in childhood (e.g., in terms of survival in an abusive situation – it engenders more hope for children if they believe they are defective as opposed to the adult being defective). By adulthood, maladaptive schemas are inaccurate, dysfunctional, and limiting, although strongly held and frequently not in the person’s conscious awareness., Pervasive life patterns which influence cognitions, emotions, memories, social perceptions and interaction and behavior patterns."
    },
    {
      "term": "vihase lapse olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/vihase%20lapse%20olek",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "lapse olek, milles tuntakse ja väljendatakse viha või raevu vastusena baasiliste emotsionaalsete vajaduste (tajutud) rahuldamata jätmisele ühe või mitme varase mittekohastumusliku skeemi aktiveerumisel, the part that is enraged about unmet emotional needs and that acts in anger without regard to consequences, The Angry Child mode is evident in uncontrolled, or poorly controlled, expressions of anger. More extreme manifestations include screaming, shouting, swearing, throwing things, banging on things, or breaking things. Less extreme manifestations include having an angry or agitated facial expression or body language, or speaking in a loud or angry voice., Feels intensely angry, enraged, infuriated, frustrated,or impatient, because the core emotional (or physical) needs of the vulnerable child are not being met. Rebels against maltreatment and vents suppressed anger in inappropriate ways. May make demands that seem entitled or spoiled and which alienated others."
    },
    {
      "term": "vulnerability to harm or illness",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/vulnerability%20to%20harm%20or%20illness",
      "letter": "v",
      "language": "inglise",
      "synonyms": [],
      "definition": "eeldus, et enda või lähedasega on juhtumas katastroof, mille toimumist ei ole võimalik ära hoida, exaggerated fear that imminent catastrophe will strike at any time and that one will be unable to prevent it, Vulnerability to Harm or Illness Schema is described as follows: The patient believes that imminent catastrophe will strike him and significant others, and that he is unable to prevent this., Hirm on tüüpiliselt seotud ühe või enama valdkonnaga järgnevatest: (A) tervise seisundiga seotud katastroof (nt infarkt, AIDS); (B) emotsionaalne katastroof (nt hirm hulluks minemise ees); (C) mingi välise sündmuse toimumisega seotud katastroof (nt tõrked lifti töös, rünnaku ohvriks sattumine, lennuõnnetusse sattumine, vm)., Fears focus on one or more of the following: (A) Medical catastrophes (e.g., heart attacks, AIDS); (B) Emotional catastrophes (e.g., going crazy); (C) External catastrophes (e.g., elevators collapsing, victimization by criminals, airplane crashes, earthquakes)"
    },
    {
      "term": "vulnerable child mode",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/vulnerable%20child%20mode",
      "letter": "v",
      "language": "inglise",
      "synonyms": [],
      "definition": "lapse olek, milles kogetakse düsfoorilisi ja ärevaid tundeid, eelkõige hirmu, kurbust ja abitust vastusena ühe või mitme varase mittekohastumusliku skeemi aktiveerumisele, experiences of dysphoric or anxious affect, especially fear, sadness, and helplessness, when “in touch” with associated schemas, This is the mode that usually experiences most of the core schemas. When we are in a Vulnerable Child mode, we are like lost or wounded children. We may appear sad and hopeless, or be anxious, overwhelmed, and helpless. As the name implies, we often feel weak, vulnerable, exposed, and defenseless. The Vulnerable Child is a remnant of the time when the person was a child needing the care of adults in order to survive, but was not getting that care., The patient believes that nobody will fulfill his needs and that everyone will eventually abandon him. He mistrusts others and believes that they will abuse him. He feels worthless and expects rejection. He is ashamed of himself and he often feels excluded. He behaves like a small, vulnerable child that clings to the therapist for help, because he feels lonely and believes there is danger everywhere."
    },
    {
      "term": "väljakujunemata minapilt",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/v%C3%A4ljakujunemata%20minapilt",
      "letter": "v",
      "language": "eesti",
      "synonyms": [
        "üleseotus"
      ],
      "definition": "ülemäärane emotsionaalne seotus ja lähedus ühe või enama olulise lähedasega (sageli vanematega) ootuspärase sotsiaalse arengu või täieliku iseseisvumise ja selge identiteedi kujunemise arvelt, excessive emotional involvement and closeness with one or more significant others (often parents) at the expense of full individuation or normal social development, Sageli esineb veendumus, et vähemalt üks üleseotud isikutest ei tule toime või ei saa olla õnnelik teise pideva toeta. Võib tunduda, et ollakse rõhutud, alla surutud või teistega sulandunud ja selge individuaalse identiteedita. Sageli kogetakse sisemist tühjust, suuna ja eesmärkide puudumist, takerdumise ja põhja vajumise tundeid, äärmuslikematel juhtudel seatakse kahtluse alla elu ja eksistentsi mõttekus, Often involves the belief that at least one of the enmeshed individuals cannot survive or be happy without the constant support of the other. May also include feelings of being smothered by or fused with others or insufficient individual identity. Often experienced as a feeling of emptiness and foundering, having no direction, or in extreme cases questioning one’s existence"
    },
    {
      "term": "vältimine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/v%C3%A4ltimine",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemiga toime tulemise viis, mis sisaldab skeemi aktivatsiooni vallandavate stiimulite nagu näiteks inimeste, olukordade, mõtete jne vältimist, a broad tendency to avoid the triggered schema or schemas, which can manifest itself in a variety of specific avoidant coping responses, Avoidant coping responses involve an avoidance of people or situations that trigger one's schemas., Social situation and/or emotions are put aside by social withdrawal, substance abuse, and other avoidant behaviors."
    },
    {
      "term": "vältiva kaitsja olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/v%C3%A4ltiva%20kaitsja%20olek",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mida iseloomustab olukordade (inimeste, kohtade, vestluste, tegevuste) vältimine, milles varased mittekohastumuslikud skeemid võiksid aktiveeruda"
    },
    {
      "term": "võimestav kujutlus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/v%C3%B5imestav%20kujutlus",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "kogemuslik kujutlustehnika paariskeemiteraapias, mille eesmärk on julgustada paarisuhte vältivat või alistuvat partnerit ennast kehtestama läbi samastumise kellegi võimsa inimese või olendiga, the imagery with the goal to energize the client enabling them to speak up towards the partner from their assertive side to overcome avoidant behavior"
    },
    {
      "term": "võõrandumine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/v%C3%B5%C3%B5randumine",
      "letter": "v",
      "language": "eesti",
      "synonyms": [],
      "definition": "Seisund, kus kesksed protsessid või normid muutuvad osalistele “võõraks” ning mille tõttu toimub ühiskonnast väljasotsialiseerumine. Selle tulemusel kaotab ühiskond olulise osa kontrollist oma toimimise ja indiviid oma elutegevuse üle. Võõrandumise tulemusena nõrgevad sotsiaalsed sidemed, langeb moraal ning tekib anoomia"
    },
    {
      "term": "õnneliku lapse olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/%C3%B5nneliku%20lapse%20olek",
      "letter": "õ",
      "language": "eesti",
      "synonyms": [],
      "definition": "lapse olek, milles tuntakse end rõõmsa, rahuloleva ja armastatuna, väljendatakse end spontaanselt ja mänguliselt ning see olek ei ole seotud ühegi varase mittekohastumusliku skeemiga, sest baasilised emotsionaalsed vajadused on ootuspäraselt rahuldatud, When in this mode, people feel at peace because their core emotional needs are currently met. They experience others as loving and appropriately protective, and they feel connected to them, nurtured, and validated. Because of this sense of security, they feel fulfilled, worthwhile, and self-confident, and are able to have a sense of optimism, spontaneity, and contentment. The Contented Child mode represents the capacity to experience and express spontaneity, glee, and playful happiness., The Happy Child Mode is a resource for playful and enjoyable activities, especially in social networks."
    },
    {
      "term": "üleanalüüsiva ülekontrollija olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/%C3%BCleanal%C3%BC%C3%BCsiva%20%C3%BClekontrollija%20olek",
      "letter": "ü",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest ülekompenseerivatest toimetulekuolekutest, mida iseloomustab ülekaalukas minevikule ja/või tulevikule keskendunud verbaalne infotöötlus selle asemel, et pöörata tähelepanu vahetu kogemuse emotsionaalsetele ja tähenduslikele aspektidelekeskendub asjade \"õigeks muutmisele\" ja vigade vältimisele, et minimeerida kriitika, pettumuse ja ebaõnnestumise võimalust, predominance of verbal-linguistic processing of past- and/or future-oriented material at the expense of attending to the contextual and emotional qualities of present-moment experience"
    },
    {
      "term": "ülekompenseerija olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/%C3%BClekompenseerija%20olek",
      "letter": "ü",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks düsfunktsionaalsetest kaitseolekutest, mis sisaldab aktiveerunud skeemile vastupidiseid käitumisi, The Overcompensator fights back either by mistreating others or by behaving in extreme ways in an attempt to disprove the schema in a manner that ultimately proves dysfunctional., The Overcompensator Mode refers to a number of specific emotional states, which all involve overcompensatory forms of coping. Overcompensator Modes involves doing the opposite of schemas, in an attempt to escape from the painful emotions associated with them."
    },
    {
      "term": "ülekompenseerimine",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/%C3%BClekompenseerimine",
      "letter": "ü",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemiga toime tulemise viis, mis sisaldab katseid toimida vastupidiselt aktiveerunud skeemile, a broad tendency to act in an opposite way to the triggered schema or schemas, which can manifest itself in a variety of specific overcompensating coping responses, Behaving in a very dominant and self-confident way, as if the opposite of the schema were true."
    },
    {
      "term": "ülekontrollija olek",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/%C3%BClekontrollija%20olek",
      "letter": "ü",
      "language": "eesti",
      "synonyms": [],
      "definition": "üks ülekompenseerija olekutest, milles olles kaitstakse end reaalse või tajutud ohu ja haavatavuse eest kõrgendatud tähelepanelikkuse, rumineerimise, enda ja teiste üle kontrolli saavutamise kaudu, The Overcontroller mode is an attempt to protect oneself from a perceived threat by focusing attention, ruminating, and exercising control over others"
    },
    {
      "term": "üleminekuobjekt",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/%C3%BCleminekuobjekt",
      "letter": "ü",
      "language": "eesti",
      "synonyms": [
        "siirdeobjekt"
      ],
      "definition": "esemed, tegevused jm, mida kasutatakse teraapia protsessis, et märgistada ja võimaldada seotuse, hoituse ja olulisuse tunnete (taas)kogemist haavatava lapse oleku aktiveerumisel väljaspool teraapiakohtumisi ja internaliseerida terapeut terve täiskasvanu oleku (psüühika sisese) esindusena, Any object or technique used (in context of reparenting and extra reparentingin in the therapeutic relationship) to comfort and nurture the Vulnerable Child and reinforce a sense of connectedness and care in order to help the patient to stay in contact with the vulnerable child mode (and with the therapist, even when they are not present) and internalize the therapist as a healthy adult mode, Igasugune (varasema arenguperioodi päritolu seotuse, hoituse ja olulisuse tunde taaskogemist võimaldav) tegevus ja/või objekt, mis toimib psüühilisi protsesse korrastava/organiseeriva ja rahustavana."
    },
    {
      "term": "üleseotus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/%C3%BCleseotus",
      "letter": "ü",
      "language": "eesti",
      "synonyms": [
        "väljakujunemata minapilt"
      ],
      "definition": "ülemäärane emotsionaalne seotus ja lähedus ühe või enama olulise lähedasega (sageli vanematega) ootuspärase sotsiaalse arengu või täieliku iseseisvumise ja selge identiteedi kujunemise arvelt, excessive emotional involvement and closeness with one or more significant others (often parents) at the expense of full individuation or normal social development, Sageli esineb veendumus, et vähemalt üks üleseotud isikutest ei tule toime või ei saa olla õnnelik teise pideva toeta. Võib tunduda, et ollakse rõhutud, alla surutud või teistega sulandunud ja selge individuaalse identiteedita. Sageli kogetakse sisemist tühjust, suuna ja eesmärkide puudumist, takerdumise ja põhja vajumise tundeid, äärmuslikematel juhtudel seatakse kahtluse alla elu ja eksistentsi mõttekus, Often involves the belief that at least one of the enmeshed individuals cannot survive or be happy without the constant support of the other. May also include feelings of being smothered by or fused with others or insufficient individual identity. Often experienced as a feeling of emptiness and foundering, having no direction, or in extreme cases questioning one’s existence"
    },
    {
      "term": "ülikriitilisus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/%C3%BClikriitilisus",
      "letter": "ü",
      "language": "eesti",
      "synonyms": [
        "jäigad standardid"
      ],
      "definition": "eeldus, et peab vastama väga kõrgetele internaliseerunud sisemistele käitumise ja sooritusega seotud standarditele vältimaks (võimaliku) kriitika osaliseks saamist, the underlying belief that one must strive to meet very high internalized standards of behavior and performance, usually to avoid criticism, Typically results in feelings of pressure or difficulty slowing down and in hypercriticalness toward oneself and others. Must involve significant impairment in pleasure, relaxation, health, self-esteem, sense of accomplishment, or satisfying relationships. Unrelenting standards typically present as (a) perfectionism, inordinate attention to detail, or an underestimate of how good one’s own performance is relative to the norm; (b) rigid rules and “shoulds” in many areas of life, including unrealistically high moral, ethical, cultural, or religious precepts; or (c) preoccupation with time and efficiency, the need to accomplish more (p. 17), Tüüpiliselt kaasnevad pingetunne, raskused puhata ja rõõmu tunda, ülim kriitilisus nii iseenda kui teiste suhtes. Kahjustatud on üldine tervis, enesehinnang ja võimelisus eneseteostuseks ning rahuldust pakkuvateks suheteks. Jäigad standardid väljenduvad: (a) täiuslikkuse püüdlusena, ülemäärases tähelepanus detailide suhtes või enese soorituse alahindamises normiga võrreldes; (b) rigiidsetes reeglites ja \"nii peab/on õige\" sõnumites elu erinevate valdkondade kohta, seejuures ebarealistlikult kõrgetes moraalsetes nõudmistes, eetilistes, kultuurilistes või religioossetes ettekirjutustes; või selles, et (c) ollakse üle hõivatud aja kasu ja tõhususe küsimustega vajadusest saavutada enamat."
    },
    {
      "term": "ülivalvsus ja pidurdatus",
      "link": "https://sonaveeb.ee/search/unif/dlall/skt/%C3%BClivalvsus%20ja%20pidurdatus",
      "letter": "ü",
      "language": "eesti",
      "synonyms": [],
      "definition": "skeemi valdkond, mille aluseks on äärmuslik keskendumine oma spontaansete tunnete, impulsside, valikute allasurumisele või püüd vastata sisemistele jäikadele reeglitele ja ootustele toimida õigesti sageli oma õnnelikkuse, eneseväljenduse, lõõgastumise, lähedaste suhete või tervise arvelt, excessive emphasis on suppressing one’s spontaneous feelings, impulses, and choices or on meeting rigid, internalized rules and expectations about performance and ethical behavior, often at the expense of happiness, self-expression, relaxation, close relationships, or health, selle valdkonna skeemid võivad kujuneda varases kasvukeskkonnas, mis on sünge, nõudlik, karistav: sooritus, perfektsus, reeglite järgimine, emotsioonide varjamine, vigade vältimine on olulisemad kui rõõm, naudingud, puhkus, (The domain) involves schemas related to violations of the basic universal need for spontaneity and playfulness. ... These schemas often emerge from family atmosphere that is grim, demanding, and sometimes punitive. In such families perfomance, obligations, duties and rule-bound behavior often predominate over pleasure, relaxation or playfulness. Children are often expected to hide emotions, avoid mistakes, and strive for perfection. There is usually an undercurrent of pessimism and worry - that things could fall apart if one fails to be vigilant and careful at all times."
    }
  ]
}